/*
**
**	$Id: jlib.c,v 1.1.3.1 1999/11/17 06:35:05 issei Exp issei $
**
*/

/* Copyright (c) Issei Numata 1994-2000 */
/* JNetHack may be freely redistributed.  See license for details. */

#include <stdio.h>
#include <ctype.h>
#include "hack.h"

int xputc(CHAR_P);
int xputc2(int, int);


#define EUC	0
#define SJIS	1
#define JIS	2

/* internal kcode */
/* IC=0 EUC */
/* IC=1 SJIS */
#define IC ((unsigned char)("´Á"[0])==0x8a)

/* default input kcode */
#ifndef INPUT_KCODE
# ifdef MSDOS
#  define INPUT_KCODE SJIS
# else
#  define INPUT_KCODE EUC
# endif
#endif

/* default output kcode */
#ifndef OUTPUT_KCODE
# ifdef MSDOS
#  define OUTPUT_KCODE SJIS
# else
#  define OUTPUT_KCODE EUC
# endif
#endif

static int	output_kcode = OUTPUT_KCODE;
static int	input_kcode = INPUT_KCODE;

/*
**	Kanji code library....
*/

/*
 * °ú¿ô¤¬´Á»ú(¤Î1Ê¸»úÌÜ)¤«¤É¤¦¤«¤òÄ´¤Ù¤ë
 */
int
is_kanji(c)
     unsigned c;
{
    if(IC == EUC)
      return (c & 0x80);
    else
      return ((unsigned int)c>=0x81 && (unsigned int)c<=0x9f)
	|| ((unsigned int)c>=0xe0 && (unsigned int)c<=0xfc);
}

void
setkcode(c)
     int c;
{
    if(c == 'E' || c == 'e' )
      output_kcode = EUC;
    else if(c == 'J' || c == 'j')
      output_kcode = JIS;
    else if(c == 'S' || c == 's')
      output_kcode = SJIS;
    else if(c == 'I' || c == 'i')
#ifdef MSDOS
      output_kcode = SJIS;
#else
      output_kcode = IC;
#endif
    else{
	output_kcode = IC;
    }
    input_kcode = output_kcode;
}
/*
**	EUC->SJIS
*/

unsigned char *
e2sj(s)
     unsigned char *s;
{
    unsigned char h,l;
    static unsigned char sw[2];

    h = s[0] & 0x7f;
    l = s[1] & 0x7f;

    sw[0] = ((h - 1) >> 1)+ ((h <= 0x5e) ? 0x71 : 0xb1);
    sw[1] = l + ((h & 1) ? ((l < 0x60) ? 0x1f : 0x20) : 0x7e);

    return sw;
}
/*
**	SJIS->EUC
*/
unsigned char *
sj2e(s)
     unsigned char *s;
{
    unsigned int h,l;
    static unsigned char sw[2];

    h = s[0];
    l = s[1];

    h = h + h - ((h <=0x9f) ? 0x00e1 : 0x0161);
    if( l<0x9f )
      l = l - ((l > 0x7f) ? 0x20 : 0x1f);
    else{
	l = l-0x7e;
	++h;
    }
    sw[0] = h | 0x80;
    sw[1] = l | 0x80;
    return sw;
}
/*
**	translate string to internal kcode
*/
const char *
str2ic(s)
     const char *s;
{
    static unsigned char buf[1024];
    const unsigned char *up;
    unsigned char *p, *pp;
    int kin;

    if(!s)
      return s;

    buf[0] = '\0';

    if( IC==input_kcode ){
	strcpy((char *)buf, s);
	return (char *)buf;
    }

    p = buf;
    if( IC==EUC && input_kcode == SJIS ){
	while(*s){
	    up = s;
	    if(is_kanji(*up)){
		pp = sj2e((unsigned char *)s);
		*(p++) = pp[0];
		*(p++) = pp[1];
		s += 2;
	    }
	    else
	      *(p++) = (unsigned char)*(s++);
	}
    }
    else if( IC==EUC && input_kcode == JIS ){
	kin = 0;
	while(*s){
	    if(s[0] == 033 && s[1] == '$' && (s[2] == 'B' || s[3] == '@')){
		kin = 1;
		s += 3;
	    }
	    else if(s[0] == 033 && s[1] == '(' && (s[2] == 'B' || s[3] == 'J')){
		kin = 0;
		s += 3;
	    }
	    else if( kin )
	      *(p++) = (*(s++) | 0x80);
	    else
	      *(p++) = *(s++);
	}
    }
    else{
	strcpy((char *)buf, s);
	return (char *)buf;
    }

    *(p++) = '\0';
    return (char *)buf;
}

#ifdef SJIS_FILESYSTEM
/*
**	translate string to output kcode
*/
const char *
ic2str(s)
     const char *s;
{
    static unsigned char buf[1024];
    const unsigned char *up;
    unsigned char *p, *pp;
    int kin;

    if(!s)
      return s;

    buf[0] = '\0';

    p = buf;
    if( IC==EUC && output_kcode == SJIS ){
	while(*s){
	    up = s;
	    if( *up & 0x80 ){
		pp = e2sj((unsigned char *)s);
		*(p++) = pp[0];
		*(p++) = pp[1];
		s += 2;
	    }
	    else
	      *(p++) = (unsigned char)*(s++);
	}
    }
    else{
	strcpy((char *)buf, s);
	return (char *)buf;
    }

    *(p++) = '\0';
    return (char *)buf;
}
#endif /* MSDOS */

/*
**	primitive function
*/

static int kmode;	/* 0: Kanji out */
			/* 1: Kanji in */

static void
tty_reset()
{
    if(kmode && output_kcode==JIS ){
	putchar(033);
	putchar('(');
	putchar('B');
/*
    if (flags.DECgraphics){
      putchar(033);
      putchar('$');
      putchar(')');
      putchar('B');
    }
*/
    }
    kmode = 0;
}

/* print out 1 byte character to tty (no conversion) */
static void
tty_cputc(unsigned int c)
{
    if(kmode && output_kcode==JIS ){
	putchar(033);
	putchar('(');
	putchar('B');
    }
    kmode = 0;

#if defined(NO_TERMS) && (defined(MSDOS) || defined(WIN32CON))
    xputc(c);
#else
    putchar(c);
#endif
} 

/* print out 2 bytes character to tty (no conversion) */
static void
tty_cputc2(unsigned int c, unsigned int c2)
{
    kmode = 1;

#if defined(NO_TERMS) && (defined(MSDOS) || defined(WIN32CON))
    xputc2(c, c2);
#else
    putchar(c);
    putchar(c2);
#endif
} 

/* print out 1 byte character to tty (IC->output_kcode) */
static void
tty_jputc(unsigned int c)
{
    if(kmode && output_kcode==JIS ){
	putchar(033);
	putchar('(');
	putchar('B');
    }
    kmode = 0;

#if defined(NO_TERMS) && (defined(MSDOS) || defined(WIN32CON))
    xputc(c);
#else
    putchar(c);
#endif
}

/* print out 2 bytes character to tty (IC->output_kcode) */
static void
tty_jputc2(unsigned int c, unsigned int c2)
{
    if(!kmode && output_kcode==JIS ){
	putchar(033);
	putchar('$');
	putchar('B');
    }
    kmode = 1;

#if defined(NO_TERMS) && (defined(MSDOS) || defined(WIN32CON))
    xputc2(c, c2);
#else
    putchar(c);
    putchar(c2);
#endif
}

/*
 *  2¥Ð¥¤¥ÈÊ¸»ú¤ò¥Ð¥Ã¥Õ¥¡¥ê¥ó¥°¤·¤Ê¤¬¤é½ÐÎÏ¤¹¤ë
 *  ´Á»ú¥³¡¼¥ÉÊÑ´¹¤â¹Ô¤¦
 */
int
jbuffer(
     unsigned int c,
     unsigned int *buf,
     void (*reset)(),
     void (*f1)(unsigned int),
     void (*f2)(unsigned int, unsigned int))
{
    static unsigned int ibuf[2];
    unsigned int c1, c2;
    unsigned char uc[2];
    unsigned char *p;

    if(!buf) buf = ibuf;
    if(!reset) reset = tty_reset;
    if(!f1) f1 = tty_jputc;
    if(!f2) f2 = tty_jputc2;

    c = c & 0xff;

    if(!(buf[0]) && (is_kanji(c))){
	buf[1] = c;
	++buf[0];
	return 0;
    }
    else if(buf[0]){
	c1 = buf[1];
	c2 = c;

	if(IC == output_kcode)
	  ;
	else if(IC == EUC){
	    switch(output_kcode){
	      case JIS:
		c1 &= 0x7f;
		c2 &= 0x7f;
		break;
	      case SJIS:
		uc[0] = c1;
		uc[1] = c2;
		p = e2sj(uc);
		c1 = p[0];
		c2 = p[1];
		break;
	      default:
		impossible("Unknown kcode!");
		break;
	    }
	}
	else if(IC == SJIS){
	    uc[0] = c1;
	    uc[1] = c2;
	    p = sj2e(uc);
	    switch(output_kcode){
	      case JIS:
		c1 &= 0x7f;
		c2 &= 0x7f;
		break;
	      case EUC:
		break;
	      default:
		impossible("Unknown kcode!");
		break;
	    }
	}
	f2(c1, c2);
	buf[0] = 0;
	return 2;
    }
    else if(c){
	f1(c);
	return 1;
    }
    reset();
    return -1;
}

/*
 *  2¥Ð¥¤¥ÈÊ¸»ú¤ò¥Ð¥Ã¥Õ¥¡¥ê¥ó¥°¤·¤Ê¤¬¤é½ÐÎÏ¤¹¤ë
 *  ´Á»ú¥³¡¼¥ÉÊÑ´¹¤Ï¹Ô¤ï¤Ê¤¤
 */
int
cbuffer(
     unsigned int c,
     unsigned int *buf,
     void (*reset)(),
     void (*f1)(unsigned int),
     void (*f2)(unsigned int, unsigned int))
{
    static unsigned int ibuf[2];

    if(!buf) buf = ibuf;
    if(!reset) reset = tty_reset;
    if(!f1) f1 = tty_cputc;
    if(!f2) f2 = tty_cputc2;

    if(!(buf[0]) && is_kanji(c)){
	buf[1] = c;
	++buf[0];
	return 0;
    }
    else if(buf[0]){
	f2(buf[1], c);
	buf[0] = 0;
	return 2;
    }
    else if(c){
	f1(c);
	return 1;
    }
    reset();
    return -1;
}

void
jputchar(int c)
{
    static unsigned int buf[2];
    jbuffer((unsigned int)(c & 0xff), buf, NULL, NULL, NULL);
}
void
cputchar(int c)
{
    static unsigned int buf[2];
    cbuffer((unsigned int)(c & 0xff), buf, NULL, NULL, NULL);
}

void
jputs(s)
     const char *s;
{
    while(*s)
      jputchar((unsigned char)*s++);
    jputchar('\n');
}

int
is_kanji2(s, pos)
     const char *s;
     int pos;
{
    unsigned char *str;

    str = (unsigned char *)s;
    while(*str && pos>0){
	if(is_kanji(*str)){
	    str+=2;
	    pos-=2;
	}
	else{
	    ++str;
	    --pos;
	}
    }
    if(pos<0)
      return 1;
    else
      return 0;
}

int
is_kanji1(s, pos)
     const char *s;
     int pos;
{
    unsigned char *str;

    str = (unsigned char *)s;
    while(*str && pos>0){
	if(is_kanji(*str)){
	    str+=2;
	    pos-=2;
	}
	else{
	    ++str;
	    --pos;
	}
    }
    if(!pos && is_kanji(*str))
      return 1;
    else
      return 0;
}

/*
** 8¥Ó¥Ã¥È¥¹¥ë¡¼¤Êisspace()
*/
int
isspace_8(c)
     int c;
{
    unsigned int *up;

    up = (unsigned int *)&c;
    return *up<0x80 ? isspace(*up) : 0;
}
/*
** split string(str) including japanese before pos and return to
** str1, str2.
*/
void
split_japanese( str, str1, str2, pos )
     char *str;
     char *str1;
     char *str2;
     int pos;
{
    int len, i, j, k, mlen;
    char *pstr;
    char *pnstr;
    int	sq_brac;

retry:
    len = strlen((char *)str);

    if( len < pos ){
	strcpy(str1,str);
	*str2 = '\0';
	return;
    }

    if(pos > 20)
      mlen = 20;
    else
      mlen = pos;

    i = pos;
    if(is_kanji2(str, i))
      --i;

/* 1:
** search space character
*/
    j = 0;
    while( j<mlen ){
	if(isspace_8(str[i-j])){
	    --j;
	    goto found;
	}
	else if(is_kanji1(str,i-j)){
	    if(!strncmp(str+i-j,"¡¡",2)){
		j -= 2;
		goto found;
	    }
	}
	++j;
    }

/* 3:
** search second bytes of japanese
*/
    j = 0;
    sq_brac = 0;
    while( j<mlen ){
	if(str[i-j] == '['){
	    sq_brac = 0;
	    goto found;
	}
	else if(str[i-j] == ']')
	  sq_brac = 1;
	
	if(!sq_brac && is_kanji1(str,i-j)){
	    goto found;
	}

	++j;
    }
    if(pos > 2){
	pos -= 2;
	goto retry;
    }
found:

    if(pos > 2){
	if((str[i-j] == ']' ||
	    str[i-j] == ')' ||
	    str[i-j] == '}')){
	    pos -= 2;
	    goto retry;
	}
	else if(!strncmp(str+i-j, "¡Ï", 2) ||
		!strncmp(str+i-j, "¡Ë", 2) ||
		!strncmp(str+i-j, "¡Ñ", 2)){
	    pos -= 2;
	    goto retry;
	}
	else if(!strncmp(str+i-j,"¡©",2) ||
		!strncmp(str+i-j,"¡¢",2) ||
		!strncmp(str+i-j,"¡£",2) ||
		!strncmp(str+i-j,"¡¤",2) ||
		!strncmp(str+i-j,"¡¥",2)){
	    pos -= 2;
	    goto retry;
	}
    }

    if(i == j){
	/* Ê¬³äÅÀ¤¬¤Ê¤«¤Ã¤¿ */
	strcpy(str1, str);
	str2[0] = '\0';
	return;
    }

    pstr = str;

    pnstr = str1;
    for( k=0 ; k<i-j ; ++k )
      *(pnstr++) = *(pstr++);
    *(pnstr++) = '\0';

    pnstr = str2;
    for( ; str[k] ; ++k )
      *(pnstr++) = *(pstr++);
    *(pnstr++) = '\0';
}

void 
jrndm_replace(c)
     char *c;
{
    unsigned char cc[3];

    if(IC==SJIS)
      memcpy(cc, (char *)sj2e(c), 2);
    else
      memcpy(cc, c, 2);

    cc[0] &= 0x7f;
    cc[1] &= 0x7f;

    switch(cc[0]){
      case 0x21:
	cc[1] = rn2(94) + 0x21;
	break;
      case 0x23:
	if(cc[1] <= 0x39) /* £°¡Á£¹ */
	  cc[1] = rn2(10) + 0x30;
	else if(cc[1] <= 0x5A) /* £Á¡Á£Ú */
	  cc[1] = rn2(26) + 0x41;
	else if(cc[2] <= 0x7A) /* £á¡Á£ú */
	  cc[1] = rn2(26) + 0x61;
	break;
      case 0x24:
      case 0x25:
	cc[1] = rn2(83) + 0x21; /* ¤¢¡Á¤ó or ¥¢¡Á¥ó */
	break;
      case 0x26:
	if(cc[1] <= 0x30)
	  cc[1] = rn2(24) + 0x21; /* ¦¡¡Á¦¸ ¥®¥ê¥·¥ãÊ¸»ú */
	else
	  cc[1] = rn2(24) + 0x41; /* ¦Á¡Á¦Ø ¥®¥ê¥·¥ãÊ¸»ú */
	break;
      case 0x27:
	if(cc[1] <= 0x40)
	  cc[1] = rn2(33) + 0x21; /* §¡¡Á§Á ¥í¥·¥¢Ê¸»ú */
	else
	  cc[1] = rn2(33) + 0x51; /* §Ñ¡Á§ñ ¥í¥·¥¢Ê¸»ú */
	break;
      case 0x4f:
	cc[1] = rn2(51) + 0x21; /* Ï¡¡Á ÏÓ */
	break;
      case 0x74:
	cc[1] = rn2(4) + 0x21; /* ô¡ ô¢ ô£ ô¤ ¤Î4Ê¸»ú*/
	break;
      default:
	if(cc[0] >= 0x30 && cc[1] <= 0x74)
	  cc[1] = rn2(94) + 0x21;
	break;
    }

    cc[0] |= 0x80;
    cc[1] |= 0x80;

    if(IC==SJIS)
      memcpy(c, (char *)e2sj(cc), 2);
    else
      memcpy(c, cc, 2);
}

/*
 * "put off"¤òÂÐ¾Ý¤Ë¤è¤Ã¤ÆÅ¬ÀÚ¤ËÏÂÌõ¤¹¤ë
 */
const char *
joffmsg(otmp, joshi)
register struct obj *otmp;
const char **joshi;
{
    static char buf[BUFSZ];

    *joshi = "¤ò";

    if(otmp->oclass == RING_CLASS){
	Sprintf(buf, "%s¤«¤é¤Ï¤º¤¹", body_part(FINGER));
	return buf;
    }
    if( otmp->oclass == AMULET_CLASS){
	return "¤Ï¤º¤¹";
    }
    else if(is_helmet(otmp))
      return "¼è¤ë";
    else if(is_gloves(otmp))
      return "¤Ï¤º¤¹";
    else if(otmp->oclass == WEAPON_CLASS||is_shield(otmp)){
	*joshi = "¤Î";
	return "ÁõÈ÷¤ò²ò¤¯";
    }
    else if(is_suit(otmp))
      return "Ã¦¤°";
    else
      return "¤Ï¤º¤¹";
}

/*
 * "put on"¤òÂÐ¾Ý¤Ë¤è¤Ã¤ÆÅ¬ÀÚ¤ËÏÂÌõ¤¹¤ë
 */
const char *
jonmsg(otmp, joshi)
register struct obj *otmp;
const char **joshi;
{
    static char buf[BUFSZ];

    *joshi = "¤ò";

    if(otmp->oclass == RING_CLASS){
	Sprintf(buf, "%s¤Ë¤Ï¤á¤ë", body_part(FINGER));
	return buf;
    }
    else if(otmp->oclass == AMULET_CLASS)
      return "¿È¤Ë¤Ä¤±¤ë";
    else if(is_gloves(otmp))
      return "¿È¤Ë¤Ä¤±¤ë";
    else if(is_shield(otmp)){
	*joshi = "¤Ç";
	return "¿È¤ò¼é¤ë";
    }
    else if(is_helmet(otmp))
      return "¤«¤Ö¤ë";
    else if(otmp->oclass == WEAPON_CLASS){
	Sprintf(buf, "%s¤Ë¤¹¤ë", body_part(HAND));
	return buf;
    }
    else if(is_boots(otmp))
      return "Íú¤¯";
    else if(is_suit(otmp))
      return "Ãå¤ë";
    else
      return "¿È¤Ë¤Ä¤±¤ë";
}

/*
 * ¿ô»ì¤òÊÖ¤¹
 */
const char *
numeral(obj)
register struct obj *obj;
{
    switch(obj->oclass){
      case WEAPON_CLASS:
      case WAND_CLASS:
	if(obj->otyp==SHURIKEN)
	  return "Ëç";
	else
	  return "ËÜ";
      case ARMOR_CLASS:
	return "Ãå";
      case GEM_CLASS:
      case ROCK_CLASS:
      case BALL_CLASS:
	return "¸Ä";
      case SCROLL_CLASS:
	return "Ëç";
      case SPBOOK_CLASS:
	return "ºý";
      case POTION_CLASS:
      case RING_CLASS:
      case AMULET_CLASS:
      case FOOD_CLASS:
	if(obj->quan < 10L)
	  return "¤Ä";
	else
	  return "";
      case COIN_CLASS:
	return "Ëç";
      default:
	switch(obj->otyp){
	  case CREDIT_CARD:
	  case TOWEL:
	  case BLINDFOLD:
	    return "Ëç";
	  case SKELETON_KEY:
	  case TALLOW_CANDLE:
	  case WAX_CANDLE:
	  case PICK_AXE:
	  case UNICORN_HORN:
	  case LEASH:
	  case STETHOSCOPE:
	  case MAGIC_MARKER:
	    return "ËÜ";
	  case CRYSTAL_BALL:
	    return "¸Ä";
	    break;
	  default:
	    if(obj->quan < 10L)
	      return "¤Ä";
	    else
	      return "";
	}
    }
}

/*-------------------------------------------------------------------------
	Á´³ÑÊ¸»ú¤Î¤«¤¹¤ì¥Ñ¥¿¡¼¥ó
  -------------------------------------------------------------------------*/
static const char *ro0 =
	"                        ¡¦  ¡¦¡¤¡¥  ¡¥£ì                ¡¦      "
	"            ¡³¡«    ¡µ¡«    ¡°¥¨¥Þ  ¡¿¥á£Ã()¡Ý¡¾¡Ý¡¾            "
	"¡¾  ¡Ã      ¡Å¡¦¡¦          ¡Æ  ¡Ç   (  )            [  ]    {  "
	"}           ¡Ò  ¡Ó          ¡Ö  ¡×  ¡Ê¡Î¡Ë¡Ï¡Ý£ì    ¡Ü¡Ý¡¿¡À¡Ý¡§"
	"¡Ý  ¡á¡¿<    >  ¡ã¡á¡ä¡á¡Á¢æ¡¦¡Å¡£  ¡û¡Ü        ¡ì  ¡¬£Ã£Ù¡á£Ó¡Ã"
	"£Ã¡Ã    ¡¬¡¿¡â//    ¡ß  £Ã£á        ¡ù  ()£Ã¡û  ¡û  <>  ¡þ  ¥³Ñá"
	"¢¢  ¢Ê¢Ü¢¤  ¢Ë¡±¢¦  ¡ß¡§¡á¨¨¡Ý->¡Ý<-¡Ã¢Ê¡Ã¢Ë¡á                  "
	"                            ¢¾¢á¢¿¢á¢¾¡á¢¿¡á(    )  ¤·£Ê||¢Þ    "
	"                            ¡°/  /£ö¡Ý  ¡á¢ª¡á<>¢Ë¢¦¥³¢á        "
	"                                    ¡¿¡²¡Ã¡²    £ï  ¢¦  ¡á  ¡á  "
	"<<¡ã>>¡ä/   ¡Á£ã¡Á£ã¡Å¡¦    ¢é                              ¡¬£Á"
	"¡¬¡¿||¡á¡Ã¤Ã¡ª|)£Ô¡Ü¢÷¡á¡Â                  ()£Ã                "
	"                                            ()£Ã¡­¡Ã¢Þ¢Ü¢Þ¢¿¢Ü¡Ü"
	"¡Ö¢¿¢Þ£ï¡± /£ï£³£ï¢»                            ¢¤¢Ê£Å£³( ¢Þ£Ì )"
	"£Æ¢á¡Ö¨§£Ã  ||¨©£ì  £ì  |<  |_  £Î£Ö||£Ö£Ã()£Æ¢¿£Ï¥á£Ð  £ã¢Þ¡±¡Ã"
	"£Ê¤· /¡ÀVV£Î¡¿¡À¢Ë¡Ã¡±¢Ü                        £ï  £ì£ï    £ã£ì"
	"£ã  £ì¡Ý£ï  ¡Ã£î¡¦£ì¡¦£ì£ì|<    £î||£ò||£ã  £ì£ï£ã£ì£ì  ¡³  ¡Ü¡Ý"
	"¤·||¡¢  £övv¡¿><£ö¥Î¡Ý¢Ü                    ¤á¤ª¦É¡³¤·¡³¡®¤Ã¡®¤Ä"
	"¡¾  ¤ó¥é¤ç  ¤Î¤è¥«¡³¤«  ¥­¤µ¤­  <   ¤¯  |+¢÷¤±  ¥Ë¡¼¤³  ¡Ü£ã¤µ  "
	"l   ¤·  ¥Ê£¹¤¹  ¼·t+¤»  ¤Æ£Ú¤½  ¥Ê¤³¤¿  £µ¤Ä¤Á      ¢¿¡¼¤Ä  ¡¼ ("
	"¤Æ  ¢¾  ¤È  ¥Ê  ¡Ã¤³¤á¤Î¤ì¤ïJ)¥Î¤è¤±¤Ï  ¤Ï  ¤Æ²µ¤Ò  ¤Ò  ¥Ï¾®¤Õ  "
	"¤Õ  ¡¿¡À¤Ø  ¤Ø  ¤Ï¤Þ¤Û  ¤Û  ¥­¤è7+¢ß¤¹¤·¤Î()¤·¥­¤Ã¡Ü¤Ä¡Ü¤Ã  ¤ê  "
	"¡£¨§£ï¾å¤¦¤Ã¤¤¥Î¤í  ¥ª¤ï£·¤Ã¤Ã¥©¥ª¤Ä¤Î¤ë¤ë¤ó¤È¥Ê/v¡Á            "
	"                                ¡¤¡Ý¥Õ¥Î¥Î£ì¥Î£ì¥î  ¥ïÕß¨¨¢Ý£Ô¢Ý"
	"¡Ü  ¨«  ¥ÊÅá¥«  ¡á¨«¥­  ¥Î¥Õ¥¯  ¥Î¥¯¥±  ¥Ë ]¥³  ¥Ê++¥µ  ¡«¥ó¥·  "
	"¥Õ¿Í¥¹  ¥ä¼·¥»  ¡³¥Î¥½  ¥¯¥á¥¿  ¥ÊÀé¥Á  ¡«¥Î¡«¥Î¥Ä  ¡á¢©¥Æ  ¡Ã¡³"
	"¥È  ¡Ü¥Î¡Ý¡²¥Õ¥áÐµÉÔ    ¥Î¡³¥Ï  ¥Ï  ¨§£Ì¥Ò  ¥Ò  ¡±¥Î¥Õ  ¥Õ  ¡¿¡À"
	"¥Ø  ¥Ø  ¨«¾®¥Û  ¥Û  ¡³¥Õ¡´¢á¢Ü¡³¥Î¡³´³¼·¡Ü  ¨«  ¨¤¢Ý¥³¢Ý¥³¢á¥³¢á"
	"¡á¥Õ£ì¥Î¥Î¥ì£ì¥Î¥³Ñá¨£¥Õ¡Ö¥Õ¥­¥¨¥¢¥¨¥é¥Õ¡³¥Î¥¦  ¥Ê¨¤¥¯¥Î        "
	"                        ¢¤¢Ê£Å£³¡Ã¡±¢Ü¢Ê£Æ£Ì£·¢Ü||¨©£Ï¡Ý¡Ã  |<  "
	"/ ¡À£Ö£Î||¢Ê¥Ë¢á£Ã()¦£¨¤£Æ£Ä>_¢Ü¡±¡Ã¢Ë¡Ã¡ñ£ï¡¿¡À¡Ã¡Ü¢Þ          "
	"                            |3B                                 "
	"                                                                "
	"                                                                "
	"                                                                "
	"                ¢¤¢Ê§¤¢¿£Å£³¡Ã¡±§­  £Æ£Ì§¦  §¬  ¢Þ¤Ã||£Ö§ª  |<  "
	"J|§±£Î£Ö||¨©£Ã()¦£¨¤£Æ¢¿( ¢Þ¡±¡Ã£ö¥Î¡ñ§°¡¿¡À£Ì¢Ý¤·¡Ã||¢Ý§¸§º§¾  "
	"§¾||¡Ã¢¿-)  |O¨§¢¾¨©                                            "
	"                £ï  ( £ï§¾§Ô¡Ý      £ã¡Ý§Ö  §Ü                  "
	"            §ã  §Ô                                  ¢Ý  §ê  §î  "
	"§î                                                              "
	"        ¡Ý  £ì                  ¨¢  ¨¡  ¨¢  ¨¡  ¨¡¨¢¨¡  ¨¢  ¨£  "
	"¨¤  ¨¥  ¨¦  ¨§  ¨¨  ¨©  ¨ª  ¨«  ¨§  ¨¨  ¨©  ¨ª  ¨«  ¨§  ¨¨  ¨©  "
	"¨ª  ¨«  ";


static const char *ro1 =
	"À¾Ð³°¡  ½÷·½B ²ÄÐµ°á¼õ¿´âã  ½÷¹ç    â£  À¾  µµ  Ø¨°¡²°  ²°  ¶åÆü"
	"ðê  ¸Í  µû»²ÌÚ¿ÉÒÌÅÚÂîÅÍµÚ  ÕßÒÉ½÷³îÃîË´¿©Âæ»å½Ü»å  µûÀêØù  ·ªÊÆ"
	"¥Í¹çÕß½÷Öø±â°Â  Æü²»°Â  Ìç²»³×°ÂÌÚ¸ý¿Í  Õú  ¥¤Î©°á  ðê  Óø°æµÝÂç"
	"²Ó½÷Êê  ¼¨À£ð²  ²»  °Ó  ÆüÌÞ´ñ      ÅÄ  ÅÄ¶¦Â¿  »åð²»åðêÅÄ·î°Ñ  "
	"Ðµ  °ß  ðê  µ®  Ò¹Ìð# ¡ôÐµ  °¿  ·î  Í­  ´ö  ¡Ý  »Î¥Ò±×  ÌÈ  ²Óµì"
	"¼¡  Ð²  µû¼å¥àÑ¹£ÅÒÇ°ø  ³­  ÓøÂç½÷°øµÝ¡Ã¿©·ç¿Ñ  Ñ¹  ±¢  ´°  º£±¾"
	"µÞ  ²»°÷¸ýÀ£ÀÐ  ÕßÐ²¡©  ÑÒ¢ÌÐ²  ¡©  ÒÇ  ÄïÄ»µ¬  ¸Þ  ÀÐð²£Å¢ÐÓ¥  "
	"µõ  ¸ý³­¼ß  °Ó  µûÒØ½÷Ï·ÒÌ´ûÊã  ÄÞ¥àÌç²¦Âº  Æó¥à·³  ±«±¾Ç¤  ¿©¼ª"
	"Ëô  µÜÏ¤³­½÷·Ê×ÄÆü±ûÍ³  Á×  ¿å  ±Ê  ±È  ±Ñ  Çµ»®¥ÒÊÇ¥ÒÊÇ±û  ¹Ôðê"
	"¸À±Ê¶âÑ¼Ìë  ÖøÝÕÈ¬»®ÇÏ¼Ü¾®·»¸À°×ÁöØúÌç·»²Æ  ÒÌ  ÑÄ  ÓøêÏÒ¹½÷Âç¿½"
	"Õß½÷×®ÀµÒÉ¿´±â  à©  È¬¸ýÆÒ  ²Ð  ²Ðµì²ÐÀ¾ËÌÆûêÏ  »åìµË­¿§ÒÉ  ±à  "
	"êÏ  ¶âÈ¬ÒÉÄ»»®  Êý  ¥·¤ÁÀ¸ÃËÑá  É×ÔïÊÆÂç×Æ¼çÖø¿´¹Ã  Æü²¦²«  ¶è·ç"
	"¶èÝÕ¹©ÅÚ¸ø±©±ü  Ä»  ¶èÄ»¶¦Í³ÑÄ  Ãæ  ²Ð  °Õ  Õù»ê°Õ  °Õ  áµ  µíÅÚ"
	"¤Æ£Ú±â  ÀµÒÇ°ø¿´Æü»®µÞ  Î©Æü£Ô¥È¥¤¥ÒÈ¿  ²Ä  ²ÃÐ¾À¾  ·½»ÅÎÏ¸ý¸ý¢Ì"
	"µÈ²ÃÉ´Ôé½÷²Èìµ  É´Ê¬²ÓÅÍ¥³ËôÅÄÌÚ²ÃÌÚÓ§·ç²ÄÄõ¿Í  ²¦²ÄÓ¥  ÌÚÀé²Ó²È"
	"¸Ç  ²½  ²Ä  ²Ã  ²¿  Áð  ²Ì  ÃîËô¸À²Ì²Ú  ²½³­²Ã  Ó¥  ±«  ÃîÊ¸²æÈ²"
	"²æ  ¼êØù¥ª  ÑáÍ³¿Ã¿Í²ç°òÃî²æ²Ã³­²çð²¿©²æ²ÃÇÏ¤Ø/|¤Ø±¾³Ñ  ¸ý  µ´  "
	"°á  ×®²ó¾®ÔïËôÅÚËè  ³¥  °á  ×°Øù¸ýÅá¸ÊÚ¾µ´ÅÍËè  Û»²üËè  ÒÌ²ÐÅÄ²ð"
	"ÈæÇò»å²ñ²ð  ²ò  Ìç  ³§  ÌÜ  ì±ÑÜ°çÎÏÍ¼¥È°ç  µÈ  °µ´ßº¨´ûº¬´û°µ  "
	"ÀÐÀ£·Ý»®¹Ô·½¸À°ç¶âì±¹ü°çÎ¤  À¼¹áÃî·½ÅÚÏËÌÚ»ÔÃîËü¶â³ÃáÁ  ³Ò  Ì¾Ôé"
	"Öø³Ô¹­  ³Ð  ³ÆÉ¢°ç  ÇäÝÕÀÉ  ÀÐð²ÀÉ  ¸«  ÍÑ  ÀÖ  ¼Ö¸òµý  Ìç³Æò¯  "
	"ÆûÃæ»ú  µÖ»³ÇòÌÚµÒÊÇÒøÊÇ·µ  Î©  ·ø  ÅÄÏËÈø  µû½©±±Ò±³²  °×  ¾®¹ç"
	"Àå  Àå  °×  ¹ü  °×  °×  ¼Ö³²ÌÜ  µû·ø¸ý½½²Ö  ²Ú  ³×ÊñÌÚ¼ëÇòÑ¹µµ  "
	"±º  Éã¶â¶â·ó»õ  ¹ÃÄ»ÌÚÉ´Ì·  Àë  µÝÊÆ¥á¥ê´¢  ¡©  Âî¸ð¥¤¸ýÑÌ¸µ¶¦  "
	"´³¥ê¿Ó  ð²ÎÏ¸Ê  Ôö  ¿Ó  ½÷¡è¸µ  Õß¸ý¸«  £Ô½½Âî´³¶ú  Òù  ´Ó  ´¶  "
	"Ôö  ¼è  ´Å  ÏË  ´±  ¼¨·çð²·ç´³  É×  ´Ö  ½Ú  °¥  Æû  ¿Ã»®ÌÜ  ´³  "
	"´±  ´Ö  à©  µí»³Âî±©·î´³½®´Æ´°  ð²¸«¸ÀÅìÅÄ³­°¥  ´Æ  Ìç  Ìç  Ìç  "
	"µì  Âîðê¿©´±çÒ´±¶å  º£¸ýÒÌ´³¸·  ²¦¸µÖøÉÊÌÜº±»³ÀÐ½¬¸µ´ç  ÒÌð²¸µÊÇ"
	"É§ÊÇ¸¶ÊÇ»ß  »Ù  Ìñ  µÈ  ¸ýÂçÂ¶  Âç²Ä´î  ´ñ  »³»Ù¥áÉÛÖöØû¸Ê¿´·³  "
	"ÌÚÑÜÊýÂ¶º±ÚÜÂ¶·îÌÚÂ¶ÌÚ  ´ö  Öä  ìµÝÕ¥áÝã¥·ÝãÖöØù¥Í¶Ô²ÓÍû´õ  »å¸Ê"
	"¡©  É×¸«¸À¸Ê³­  Áö¸Ê¼Ö¶å¸÷·³¿©ÑÜÇÏ´ñ·»¥à¶ú¿½°Ù  µÁ  ½÷»Ù³î  µõØù"
	"»Ù  µ¿  Â¶·çµÁ  ¥Ò¥Þ¥Í»áÍÓ²æµÁ  ¸Àµ¹µÁ  Ò±  Ò±  ³×Ò±»Î¸ý¸ð  ·À  "
	"ÌÚµÈÌ·  ¸ÀµÈÀÐÀêÌÚ¸á²Ó  µîÒÇ³Æ  µÑ  éÈ£ÅÖ¥  ¶Ô  ¥¯¥¹¥¤¶å¥¤ÌÚÇµ  "
	"µÚ  Ï¤  ¥³Ò¹¥è¿´µáÚ¾ÌÚ£µÃú  µÚ  Î©  µ×²Ð²¦µá·ê¶å¿ÈµÝµÚ  µÚ  »å½½"
	"»å¹ç¡ÃÆü¸á¥­ÅÚ¥àÕù¸ÅÒ¹£Åµð  ½è  ¼ê  µðÌÚéÈ  ¸À¸áÂ­µð¶âµïµû  ¸æ¼¨"
	"¥¯ÅÄÐµÎ»µü  ¸ý¾®¶¦  É×  ¶¬  ¶§ÑºÎ©·»Æû  Ñá¥áÎÏ¡èÒ¹²¦Â¨±¬¸ý½½ÆÝ¸þ"
	"ðï  É×  µÝÃîµÝÏËµî  ËÞ¿´¶¦¾®É×  ¹§Ú¾¶¬  ·»  ²¦  É×  ¶¬  Ç¾Ò³ÎÏ¡è"
	"Æ±  ¶¬  Â¨  ¶âðï¶¿²»¶¿¿©·ÉÇÏ¥¤ÒÇµ¿  ÒÃÑºÆü¶ÆÌÚ¡ïÕù¶çÅÄ¡ôÐ´µà²¦  "
	"Æ±  ÊÆÀéèÁ  èÁÎÏÅÚÒ±ÑÄ½½¶âÖçÒÌ£Ô¶Ô·ç¶â·ç²¦º£ÎÓ¼¨¿Í¥àÏ¾  ¿Ã»å¶Ô  "
	"è¡  ¥Íº£¶Ø  ¸ÀèÁ¶Ô  Á´¶Ì¸ýº£¶âº±¥Ê L¶ñ  Ò±  Ò¹¥á¶ç  ²¦µ×Ìðµð¸ÅÆÑ"
	"¿È¶èÇÏ¶èÇÏµÖÇÏ¶çÌÜÃ¶ã¼  éÈ¸â¿©  ·ê¹©ã¼  ã¼  ã¼  ã¼  Ãæ¥­Àá  ¶âÀî"
	"Õù¾ÓÕù½Ð¶þ  ·ê¶þ¿åÆü³×²½»å¼Ö·ê·½Ç½  °Ú  µ×ÊÆÀ¾ÌÚ»åÉÊËôÌÚ¶â½©Æ°  "
	"Õú±¦½Å  ¸ÀÀî·¯ÍÓ¼Ö  ·¯  ·½¥È²Ã°á¥Í  ·Ï  ²½º¢´©  ¸ýÑº¸ÍÚ¾ÅÚ²¦²¦·½"
	"·º  ÀÚ  ×°×Ä×ÆËô»×Í³Öø  µÞ  Àå¼«°×  ð²Çµ¶çÚ¾Ã¶µþ·½  É×  ÅÄ·½Ìà»Ý"
	"»å  »åËô»åÊÆ¼Ö»å·µ  ËôÅÚ·º  Ãî  ¸À½½¸À»Ý·É¸À¼ÖËôËôÊÇÉ×Ä»±¾  ÒÇ  "
	"µûµþéÈìµÂîØù¼Ö¼êÇòÊý¾®Æü¹Ô  Á¤ÌÚ¿Í¥±ÔïÑÓ·À  ÕßÈ¬»åµÈ»®  ¸ÀÔïÆü  "
	"¥¤µí»È  ´¬  ·ú  ¥è¡ôÅá  ±û  Àë  Óø´¬¿ÃÅÚ½÷·ó×®ææ¿´  ¸©·Ï¼ê  ´¬  "
	"±û  ð²  Ì¶  Âç  Æî¸¤ÀÐ  ÀÐ¸«»å·îÌÜ¼¨¸Í·îÌÜ·»¸À·ó¿Ã³­¼Ö´³ÄÉ  ¶â·ú"
	"±û  ÆüÊÇÇÏ±ûóÃ±ûÑº¥ÆÒÌÇòÒÌ´ºÖö¥ÕµÝ¸¼Òù  ¸¶  ÐµÖö²¦¸«»å¸¼½®¸¼»°¸ý"
	"¸ÀÉ§º±  ÀéÊ¿¸Ç  Àê»Î¸ý¸ÃÓø¸Å½÷¸Å»Ò±»¥³  Öø¼ÖµÝ±»¡±Õù¸ÅÚ¾ÌÚ¸ÅÝø¸Õ"
	"±»  Ç´¸ÕÔò  ·îÝÕ¸Å·î¸É  éÈÑ¹¸ÀÔòÂ­Ôò¶â¸Å¸Íð²¸ÛÊÇÆ¦»Ù²¦  ×À  ¸Þ  "
	"´³¥±¥æ¸ý¸Þ¸ý½÷¸âÖöÔé²·½¾¾®¸ãÌÚ¸ã¶Ù  ²¦¸ÕÂ¶ÀÐ¸À¸ã¸À¸â¸ÀÀÉÆÓ¸Õ²µ  "
	"µûÎ¤Ï»Éã¸ò  ¥æÌð¥æÌð¹¬  ÐµÑº¥Ï¥à¹©ÎÏ¸òÎÏ¥àÒ±ÒÌ»ÒÑá¥³ÑÄ¸ýÒÌÀÐ¸ý¸ô"
	"ÅÚÐ¶ÅÚ¹¡½÷»Ò»Ò¤·»ÒÅÚÕß¥à£Ô¢Ý¥¨Ëü¶¦¸ÊÅÚ¿ÉÖø¥àÖøÕúÖøð°µÝ¥à¾®ÏË¾®¹Ó"
	"Ð¶  ¶ç  ¶õ  ¥¨Ú¾Æü°õÆü¸÷Íù  Ð¶  ¸ò  ¹¹  ÑÊ  ¥·¹©¥·¶¦¥·¹ð¥·¹«¥·ÑÊ"
	"ÅÄÃæÄèÚÝÀÐ¹¹²Ó¹âÊÆ¹¯»å¹©»å¥à»å¸ò»å²¬æÐ°æÅÚ£µ»ß·î·î¥à·î¶õ¹â·î½®Ð¶"
	"çêÀî×Æ¢©¹Ôµû¸ÀÑÊ¹©³­³­ÑÊ¸òB ÆÓ¹§¶â¹­ÀÐ¹­¶â²¬Ìç¹çÔé¥ð¹©ÊÇ²ÓÆüÐµ¸þ"
	"¹¾Ä»²¬l|µîÎÏ¸ýËü¤Ø¸ý¹ë  ¹Í  ¥·¹ë²È  ¼Ö¡èÇþÒ±¸Å·»°ç  µíµÈ¶©¶Ì²Ó»¦"
	"ÆÓ¹ð¹ðÌÄÎ¤  ¸À¸¤¥·¼¯·îÍ×Á¾´¤ÌÞ¿´¹ú  ·îÓ¥Çò  Æþ  »ßÈæ¥ÒÊÇ¥Ø¥é°øÌÚ"
	"ÅÚ¿½ì¸º±½÷ºª¾®º±ì¸º±»áÆüÆüÈæÌÚº±ÌÚº¤º«  Öøº±»å´ÅÆü£Ò±¾µ´º¡¥Ë¥¤º¸"
	"Ëô  °ô  »³º¹¥Ê¥¨æµº¸ÌÚ³î¥·¾¯²¦º¹ÀÐ¾¯¸ÀÆã¶â³­º»°áÅÚÐºÖøºÁºÁ  ÀÕ  "
	"ð²  ÑÇ  ¼è  µÈØù´ð´¨¥è½÷¿É  ºÓ×Ä¥ªÃúºÓ  ÌÚØù»ßÀÌÀÆ  Öß²Ð²Ó¥ÄÕùµí"
	"ÀÐÒÀº¡ÀÐÍ¼¼¨ÀÆ¼¨»åÅÄºÓ  °áØù¼ÖØùB º×ÀÆ  ÅÚ  ÌÚºÍÈó  ³­ºÍ²ç  È¿  "
	"È¿  ³¦  ¿À  ¥áÍ­¸ýÅ·»³´ñ´ñ  ÀÐ´ñÏ©Ä»¥¤Æã¾Ó  ¸ýÆãºõ  ÆüºðÖ¥·îºý  "
	"·êÆãÛ³  »å  ¶âÀÎÌÚ½÷µû·½À¤  À§¥Ò»®  Õù¶Òº×  ÖßÍ¼ºÇ  »¡  ÌÚ¤·²ÓÝÕ"
	"»º  ÒÀð²ÇòÁáµûÀÄÊÌ²ý¶âÀÄµû¸ò§ê||ÆüÀ¾Æó¢áÐ¤  ¥à×ÄÑá¢Ý»²  »¶  ÀÎÚ¾"
	"ÌÚØù²ÐÊÆ²¦ºýÉ§À¸ÌÜ×°»»»åÅ·Ãî»¿  É×³­ÆÓ°ô¿©  ¼Ö¶Ô»ÂÆüÝÆØù½º»Î¥¤»Ò"
	"»Ê  ¥¤ÍùÛ³  =]  ¾æÃæºý»ÊÉ¤¸ý½½¢Ý½÷Âæ½÷»Ô¼¡½÷Î»°ìÕù»à¶Ò  Çò¶Ò»Î¿´"
	"ÅÄ¿´»Ý  »ÎËô»ÒÚ¾Â¶¶ÔÊýÌé¥ÒÆüÌÚ»Ù¾å  ÝÆ¥Ò[+EE»Õ  ¥Í»ß²Ó¥àÖö¾®»å»á"
	"º¡»å·î»Ù·î»Ý¥à¿Ñ½Ë¸«¸À»Ê¸À»û¸À¼°¸À»Ö¸ÀÒþ¼¡³­³­°×º¡ð²¿©»Ê»ßÊÆÐ¯¥è"
	"°Ê  »û  µìÑ¹Õß»ÒÅÚÀ£Öö¿´»û  Æü»û·ç  Öö  ÌêÂæ±«  ¼¤¶ÌÖø»ûÀÐ¼¢¢©¾®"
	"ÑÄ  £´ÅÍÇòÌÜ»þ  Àå¿É¥·Í¼ÖøÈæ¹©×µëÞºÈÅÄÌÄÃÝÆó¼ÖÍ³·êÏ»±«²¼¤·¡Ü¸ý¼·"
	"¹¬´ÝÌðÉ×½÷¼À»ê  ºÓ¿´¥·ÆüµÐ  Öø¼º¶Ô³­É×  Éô  Ûê  ÄÑ»×º¡ÌÚÇ·  Õý  "
	"¿Ä¡è»å¹â¹ç  Í¿  ¿ÈÀ£¼Ë½¦ÀÖÚ¾Í¾ÅÍ¼Ô  ¥ÍÅÚ»å¾¯ÅÚ±¦Æ¤¼ÍÏËÂî½î  ÃîÕà"
	"²ç  ¥¤ÀÎÒ±  ÕùÈ¬ÌÚ¼Û²Ð¼Ûº±À£ÆÓ¼Û²Ó¼Ü¶â°×±¦  ½Ç  µÝ±©¼ã¿´²¦  ¼ªËô"
	"À£  ¿Ñ¥­µí  ÝÆ¼ë¼é  ²¦¼ë²Ó½Å·î½ÅÁö¼èÆÓ  ¼«É´¼û  Ëô  ·»  »°À£¼õ  "
	"ÌÚµË»å¼õ±«¼©Óø¿ÍËô  µÈ  ¼¨  µþÌàÀî¡ÄÚÁ×Ä½©¿´¹ç  ½£  ²ÓÇµ²Ó²Ð»åÅß"
	"½Í  ±©Çò¼«ÂçÃ°  µ´  ·ì  Î¶  ð²¸ÀÂ­½¢¼Ö¼ª¼þ  ÆÓ  ÆÓ½£È»ÌÚÆÓµ´¥¤½½"
	"»Å¼ç°ô  °ì¡Ü×ÆÉ¥Øù  Ì·ÌÚÑÒ½½»ß><á·¸¤»å½¾ÀéÎ¤¶â½¼¥ÛËôÝÆ  ÐÑ  ½Ç  "
	"¥Í·»»å½ÉÊÆ  ÕÙ  ÕÙ  ÅÚ»³¹Ô¥Ü¥Ü  °ô  »³°ôÆüÉ×½Ø  Î©°ôÁ¤  ÇÏ°ôð²  "
	"½â  Æü¶ç½â  ÝÆ½Üµý  ½ÚÈ»±¼  ¹¡  »åÆÖÖß  Âº  ÆÓµýÀîÊÇÔéÑÜ¥ÍÅá¸Í¶Ô"
	"Æü¼Ô½ð  ¼Ô  ÖøÆû»å¼Ô¼Ô  ææ  ½ð  ½ô  ¸À¼Ô³îÎÏÍ¾Ëô¤¯¥ÎÖøÍ½Í¾  Ç¡¿´"
	"¶â½õÍ¾  Úæ  ¾Þ  ·ô  Ò¹¶Ô¥Á×°Åá¸ý¾Ó  Î©ÑÈ¾»  ¾°»Ý¾­ÂçÎ©½÷½÷¾»¾Ó  "
	"À£  ¥ÏÐ­¾®  ¸þ  ÖøÅÚÖøÌÚÖøÚÈ¾Ï×ÄÎ»¿å¾¯  ¾¤  ¾°¼êÁö  Æü¾£Æü  Æü¾¤"
	"¾»ÉÊÌÚ¸øÌÚ¾ÓÌÚ¾ÏÌÚ¾Ç¾¤  ¾Ó  Êâ  ÝôÁê²Ð¶Æð²  ¾¼  ÖøÀµ¾¯ÌÜÀÐ¾ÓÀÐ¾Ç"
	"¥ÍÍÓ²ÓÕõ²»ÁáÔð  ÊÆ¾±»å¾¤¾®·î¾»  ¾­  ¾Ç  ¹Ô½Å¾°°á¸À¸ø¸ÀÀµ¸À¾¤¸ÀÍÓ"
	"ìµ  ¾°°÷¾­ÆÓ¶âÀµ¶â½Å¶âÆ¸¾Ï  ³×¾Ó¨§¢Ý¥Ê¥áÎ»¿å²Ó  ÑÌÑÜ¾è  À®  Úæ  "
	"ê÷  ½÷ê÷¾°ÄßÀÄ  Í«  ÔéÌÚÌÚ¾æÁè  ¸¤  ÅÄ³î²Óê÷¾ç  ¸Àê÷ÆÓê÷¶âÄêÂ°  "
	"Ä¾  ¿©¶Ò¼°  Ä¾  ÝÆÄ¾²Ðéæ»åºÈ¼ªºÈ¥¯ÇÃ³ÑÃîÎÉ  ¿©ÃîÃ¤À£Õù¶åÃç¿½¸À  "
	"¥èËôÃ¤¸ý½÷Ã¤¿»  ÈÖ  ¥Ï¤¸¿¿  Ã¤  ¿É¶ÔÆü  ÎÓ¡è¿Á  ¥èËô¾éÌÚÍ³¹ÃÖø×Ä"
	"¶ñÄç¥Í¿½²Ó  »å¿½µð  ¿´  ¿·  ¿É¸«¸À×Ä¼«¥ªÎ©¡ïð²  ¶â½½±«Ã¤¥Î¤Ø¥¤Æó"
	"Åá  Öø  Àé»Î¥èÀ£Â¶É¤¼Ü  ¿Ã·î¸À  ½½  ¼Ö  ³×¿Ï»Ê  ¸À¼è×ÄÊÇÆÓÆãÓø¥á"
	"ÒÌÀ£Æ¦  ¸ý·çÀé¿½¶Ò  ð²  ¥ÕÐ­²Ð·çÌÜ¿âÊÆÒÀ±©Â´°¥  ìµ  ÆÓÒÀ¶âð²¶â¿â"
	"Í­  ²¦¼©¹üÍ­»³½¡»³¹âÊÆÚ¾ÌÚ¶èÁöçíçíð²µï  ÌÚ×ÄÌÚ¾»´±  ÈéÊÇ¾¯ð²µï  "
	"ÅÐ  ½¬  Ãú¡Ü¤»ÆûÍê  ÅÄµ×ÆüÉ¥ºÊ  »Ô  ´ÝÎÏ½÷À¸Àµ  À¸  Øü  ÀµÚ¾Â«Àµ"
	"ÆüÀ¸ÆüÀÄÌÚºÊÌÚÀ¾»ß²¼ÀÄ  µíÀ¸µí²¦À®»®ÊÆÀÄ¼ª²¦»ÎÕùÀ©°á»Í  ¸ÀÀ®ÀÞ¸À"
	"¸ÀÀÄÀÞ  ÆÓÀ±²¦·îÀÄÁèÊ¸  ²Ó·»·î´íð²ËôÖø¶Ò¾®ÀÎÀ®¥Ü¶Ô  Æü  ÌÚ¶Ô¸ý  "
	"ÀÕ  ÃÝÀÎ»åÀÕÉ×·î²¦³­ÅÚËòÂ­ËòÂ­ÀÕÀÐÊÇ¼·Åá½Ð  ¾ª  ¼ª><¶Ô  ¸ÀÝÕ·êÀÚ"
	"ÃÝÂ¨¸À·»±«¥è»å¿§¿Ñ¸ÅÃîÃ±¥¤»³µíÑº½½¥¤¾å¸ýÏË  Í³À£¾®Âç¥Îl|Ã±Øù¸Í±©"
	"Ã§  ÌÚÁ´ÌÚÃ°Çò¿åØù  Àè  ÒÀ  ÂØ  Á°  Àð  ÊýÉ¥·ê²çÃÝÁ°»åÀô»åØùÍÓ¼¡"
	"·îÀôÍ¼¥ð½®È¬Öø  ¸ÀÁ´³­ØùÂ­ØùÃ§  ´¬  ¶âØù¶âÀèÌç¿ÍµûÍÓ·îl|ÍÓµÈ»Â  "
	"¥¿¸¤Ð¤²¦¥ÍÃ±»åÁ±·îÁ±ÊÆÎÒ¾§Á¾ºóÅÚ»³³îÀÎ  È¬ÆüÅÄÆüÎÓÉ¥³î  É¥½¼É¥Â«"
	"ÀÐÁ¿¥Í³î²Ó³îÊÆ³îÅÚ»å»å³îµû²Ó¸ÀÀÍ³î  ºó  ±±  Á¾  ÁÒ  Ëô  ¶È¼è¹ç¸Í"
	"°á  »Î  ²Ó  Âç  ÌÚ  ÕùÁ¾Ò¹¶ÒÊª¿´Áê¿´Í³ËôÖä  Àé¿½ÇÂ  ÉÊÌÚÃ¶´³¶ÊÆü"
	"Ã±²ÌÁÒ  Áâ  Áâ  ²ÐÉÊ¥¯ÕúÖøÍ³ÌÚÌÜ·ê¿´ÊÆÁâ»å¸ø»å½¡¼ª¸øÁá  ÁÔ  »à×°"
	"ÁÒ  ÉÊÌÚÁÔ°áÅÚÉ¥Å·  Áâ  ¶âÁÒ±«ÁêÇÏÇÂ¾Ý  Á¾  Á¾  Â¢  Êê  ³­Á¾¹ð  "
	"Â­  Â§  ³­  º±ÒÇ¼«¿´Â­  Û³µþÂ§  ¸ýÉ¥Â«  Ã«  Õùã»³­²üÊýÌð»åÇäÐµÐº"
	"¥ÍÍ³´Å³îÁ°  ¥Ê»Ò»Ò·Ï½¶À£°÷  ÌÚÀ£Â¹  Ìé  Í¼×ÄÂç  ÂÀ  ¸ÀÕà¿â  Í­  "
	"½÷  º¸·îÃú  ÌÚÕà½®ÕàÌÚº¸Õà  ÇÏÂÀÇÏÃ±¥¤ËÜÅÚ½ÚÊ¸À£¼©À£Âå»³ÒÂ¶Ò»ø  "
	"Âæ¿´Ç½·§°ÛØùÉ×ÆüÉ×¿åÂÓ  ·îÂæÂà  Âæ  Âå°áÂå³­º±  ð°  ìµ  Âå¹õµû¼þ"
	"¥¤×µ¥à¸ý¿Í¥ÊÃÝÄïÆÓÀ§À§ÊÇ´çÄ»Îµ  Î¶  ÀêÁáìµ  Õß¥â¥â  ¼Ü  ÀÐ  ¼Ü  "
	"¥è½Ú²¦ìµ¸À¥â¶âß·éæ  ¸À¼ã¼ª  ¶Ò  Ãî¾Ó¸ý¥Ï¸ýÒÇ¿ÎÃ¶¹¬  ÒÌ  ð²À£·î·»"
	"¸Ê¶¦µðËô»³  ÌÚÊþ¥Ø¸ýÎ¤  µûÀãÌÚÂº¸Àð²×°  Ááá·¸ýÉ×ÅÚÃ¶Ã³Ã¶¾éÌÚÆü  "
	"É×·ç±ê  ¿Ó  »³³¥ÌðÆ¦Î©¼©ÃÝÃ±»åÄê¼ª  ·îÃ¶É¥Ãî¸À±ä¶âÃÊÓøÀ£Ð¹  µÝÃ±"
	"ÊÆ¶ÔÆüà©Ð¹  £ÅÝÕÅÄÎÏ¸À±êÄ¾  Ìð¸ýÅÚÌéµÝÌé¼ª¿´ÃÎÆüÌé  ÖøÃÎ²Óð²Ä¾  "
	"»êÚ¾ÃîÃÎÕùÍÓÇÏÌéÃÞÌÚ¸¼ÅÄ¥±TTÃÝËÞÃÜ  ìµ  ²Ó¼º·ê»ê¥ÛÐ¤½÷¾¦ÍÓÌÜ¥­½½"
	"¥¤ÃæÍ³  Ãæ¿´Í³  ¼ÜÃ¶ÌÚ¼ç¼ç  Ãæ  °¥°á¸À¼çÆÓÀ£¶â¼÷ÇÏ¼çÌÚ±«Ãö½í¼Ô  "
	"Ãú  ¼Ô  ³­  °ìÐ­Ñ¹ËÌ¼þ  ¸ýÀ¤Î¶  ¶ÒÀê¶ÒÄ¹ÖøÃúµÝÃúµÝÄ¹¼þ×Ä×ÆÚ¾Ä§  "
	"Ãû  ¿½ÚæÂî·îÄ«  ÊÒÀ¤ÅÄÃúÌÜÃû¼ª¿´·îÄ¹·îÚæÃîÀ¤¸À¼þ¸ÀÀ¤Áö¾¤Â­Ãû¶âÃû"
	"£Å  ÃúÊÇ±¨ÇòÂ«ÎÏÊâ  ÌÜ  ·îÅ·¥·¤ó²¦×ÄÇ¤³­¶â¿¿Åì  ææ  Ââ  ÌÚð²ÌÚÄÉ"
	";g  ÄÉ  Öøáµáµ  ²È  ÌÚÊì¹ñÙ«ÌÚµ¬ÅÄ  ÀÕ  ÌÚÀÐ½½íèÄ»  »åËô¶âÒøÌÚ½Õ"
	"µ®  ÅÚÊ¿°¡Ôä½÷¼û»åÍ³¥¤È¬¸ý¶Ò¶â¼Ûð²Ä»ÐµÃú»á  Äâ  Äç  Äï  Àê³­¸ý²¦"
	"À§  É¥  Î©¶ÒÖø»áÖøÄî×®¿ÑÄ¤¡ïÄï  »á  Äî  À§  Äï  ¥·ÃúÀÐÄê¥ÍÄç²ÓÄè"
	"»åÄë½®Äî¸ÀÃú¸ÀÄëÂ­ÄëéÉ  »á  ÆÓÂç¶âÃúÌÜ  Æô  ¾¦  ¥è¿ä¾¦Ú¾¾¦  Çò¼Û"
	"ÃÝÍ³¾¦  ¶â¾¦¼å  ÀÞ¸ý»¶  »¶  ¼Ö»¶¼º  ¶â¼º¶Ê»®ÅÚ¿¿Âç  Õù  ÖøÀêÔð¾®"
	"¿Ð  Àå´Å³­Àê¼Ö±¾¿¿ÊÇÀêÂþÊ©±¾Ö¢ÝÕÅÂ  Æü½Ð±«¹Ã·»  ¸ýÅÚÊª  Í¾  ½÷ÀÐ"
	"Õù¼ÔÁö  £´  ÌÚÅÚÅÙ  â¢Æ¦ÌÈ  ³­¼ÔÍ¾  ¼Ô  ¶âÅÙÀÐ»áÀÐËüÅÛÎÏÖøÆû½½¾å"
	"½÷ËôÅÛ¿´Åþ  ¾°·»Ôé  Åì  ¥Î¥ÕÖø  è©  Åâ  ÂçÄ¹ÀÐ  Ä»  »³Ä»Âî  ÝÕ  "
	"Åã  Â«  Ãû  ¼÷  Åì  ¼¡»®´ÌÒ±Úæ  ¼÷  ²ÐÃú²ÐÅÐ¥è  ÖøÆ¦¼÷  »û  ¹ç  "
	"Æ±  ÊÆÅâ»å½¼»ê  ½Å  Åò  Þî  ¸ÀÀ£ÍÀ  »°¸ýÂ­·£Ãû  ½¨  ¶âÅÐÅñ  Æ¦ÊÇ"
	"ÇÏ  Ìç  Æ°  ½ÅÎÏÑÄ  ¾°ÅÚÆ»À£Æ¸  Æ¸  Æ±  Æ¸  Î©Î¤·îÆ±µÆ  ¼ó  ¶âÆ±"
	"¾å²¼Ä»  Ò¹¼ãÆüÀ£×Æ¿´Çä  »ý  ½ÇÌÜ²ÓÑ¹ÇÏ  Êì  Ãî  ¸ÀÇäÌÚËü¾Ý  Ñá[]"
	"·êÂçÃÊ  ÕùÍ³Ä»×µÀê  Ãè  À¾  À¶ÀÅÆÜ  »³¥âµý  µýÚ¾ÆÖ  ìµ  ½â  ÆÖÊÇ"
	"Ôð±¦±À  ¶âÆÖÂç¼¨±¯ÅáÑÄ¿Í¥±²¼»ß  ðµ  ÌÂ  Æñ  Æà  ¶âÓ¥½¶  ÇÏÀî»åµµ"
	"ÅÄËôÑÄ¡ïÆî  ¼Ö·çÉ×ð²½÷  °ì  Õù¥ÒÆó×µÕõ  ¥ÒÒ±Ã¤  Æâ  Ãî¹©++  ¸ý  "
	"ÕÕ¤·¥Î¡À½÷¸ýÕù¿åðì  ¿ÑÐÂ½÷¿Ñ¿Ï¿´Ç¦  ¼û  ¼¤  ¥ÍÕõ¿´ÃúÒ²¹úÉÁÉÄ´Ý  "
	"¸á¥ðº£¿´Ç°  Á³  Á³  ÊÆÀê¥¢  ×®À¾Ðµ£ÚÎÓÅÚÂ¶°á¥Ä¶§ÇÀ  »åÆâ¥à¥Ò¥Ä¶§"
	"ÇÀ  ¶ÊÃ¤»Ê¸«ËôÃîÌ¦  ÇÃ  ÈÖ  ¾ä  ÇÃ  Èé  ÄÞ  ²¦ÇÃÀÐÈéÇÈ½÷ÇÏ  ÇÃ  "
	"£Å£µÈó  È¯  Ù°ÙªÈó  ³­Ú¾ÌÚÉÔÉÔ»®ÊÒÈÜËÌ·î·î»ÔÈó¼ÖÆÓ¸Ê°Ì¸ýÎ©¸ý½÷Ë¿"
	"Ëè  Ë¿  Ë¿  ³­  ËÁ°÷»Î¾é³­Î©Î©¸ý¸À  Ãîµµ²ÓÊ¿Ìð°ú½©  ¿ÎÇò¥è¥æÀì  "
	"Çò  Çò  Çò  Æü±±Çñ  ÊÆÇò½®ÇòÀì  Çò  Ë½  Çü  Ë½  Àì  Ã¶Å·ÇÏà«Í§  "
	"Ñá  Áê  ÀÐÃ«¼Ô  ææ  Àå  Î¸  ÈÖ  ·îÑÜ²ÐÅÄ¾»ÅÄ¥Î¡À¶âËÜÈ¯  â¢  ÆÓÈ¯"
	"ñõÍ§ÂåØùëÊ  Í§  È²  ÌçÈ²¶åÄ»¿·  ¹â  Ãî¹çð²  È¾  È¾  ¥­¡ïÒÌËôÈ¾È¿"
	"¶ÒËÞÅêÈÌ²¦Ê¸È¿  :e  ËÞ  ÊÒÈ¿)e  ²¦¥êÅÄÈ¾ÉÒ  ½®ÝÕÈÙ  ³­È¿íÂ  ²ÓÊÆ"
	"²ÐÊÇÊ¬ÊÇ¿©È¿ÌÈ  ÌÈ  ÈÐ¹áÈÌ»®ÈÌÀÐÈÖ  ËòÃîÒ¹ÈóÅÄ¥ðÐ£  ½÷¸ÊÖøÈæÈé  "
	"Èó¿´¸ÍÈóÈæ  Èé  ÈóÊ¸¾å¥ÒÉ¬  ÖøÈéÖø»ÙÀÐÈÜÉ¬  Èó  Ç½  ·îÇÃÈé  Èó  "
	"Ê¦³­íä  ËÌ]E¾£  ÄÌ²³Â¶ÈéÍÑ  ÕùÌÓ×ÆÚ¾Èæ  ÅÄº«²¦ÈæÕùÌÜÍÓÉ×È«  ÌÚÅß"
	"ÈÜ  Ò¹Ñ¹²¼£ÅñõÈæÖø×Ä¼¿  çì  ·îÀ£µÝÉ´¿´  Î¤  ææ  ÅÄ  ÌÚ²ñ½÷¿Ã½÷à©"
	"»å±¯Çò  ±©×ÄÉ½  ¸××ÄÉ¼  ¿å  É¼  É¼±»À¾¼¨°á  ¸ÀÊ¿ì¸¼ÛÖøÄ«ÉÄ  ÖøÊº"
	"²Ó¾¯ÅÄ  ¶âÉÄ¶âÊ¼¼¨  Ãî»êµûÏ·¸ý¡èÎÓ¿ùÉð  Ê¼  ¾ÄÉÑÉéÊ¬ÉÏ  ÊâÊÇËèÚ¾"
	"Öõ´¤¥ÏÐ¤¥¤À£Éì  ÂçÅ·½÷ÖäÉÚ  Æ±ÅÄ¥Ê¶ÒÖøÉÕÉÛ  É×  Êü  Éã¶ÔÊÂÆüÕÕ  "
	"È¬Ð©ÉÕ  ÉÜÆùéÈ°ßÉ×  ¸ÀÉá¼«³­Éð  Áö¥È¡ê  ÉÕ  Ëè  Ìµ  Àµ×µÌµÁ¤Êãè¦"
	"Ìµ  Î©¸ý·½À£É÷  ÂüÃîÂû  Ï©  Âå¸¤¸ýÅÄ×ÆÔé¶ÒÅÄ·îÈ¿¥ÍÅÄ·îÔé¥ÍÔéÉü  "
	"Àî  Ä¤°æ¥à  Ê¦  ¥¤¥àµíÌÞµûÉÕÈ¬ÅáÌÞ  ìÌ  ìÌ  ìÌ  Ê¬  ÎÓ²ÐÓ´  ÊÆÊ¬"
	"ÊÆ°Û»åÊ¬±«Ê¬ÐµÐ©Ìç¼ªÆâ  Öõ  µÖ  Ö¢  ÚÉ¶Ò´³  ÚÉ×°Êº  ¡Â¹©ÚÉ  ÌçºÍ"
	"ÈæÅÚÌÚ¢¨É´³­íä  íä  íä  àáÀÐËü¥êÚÉÌÜÌÐØûÆâÈæÙ¨  ËòÔéÖø¨¤Ù¨  Ù¨  "
	"Åá  È¿  Ù¨  ¹¹  ÌÈÎÏ½÷ÌÈ¥à×°³×ÊØµÙÊò¼ËÊã¶âÊãÓøÊãÊã  »ß¾¯ÍÑ¿½Êã  "
	"¼ÖÊã·Ã  ÇüÊ¬ÇüÅÚÇü¾®×µ  ÇüÆüÃ°¥èÀì  çþ¥íÊü  Êô  ¸ÊÒ±¥íÌÚ¹¬È¿Ð¤É×"
	"¶Ì  »³Ôé»³ÔéÊþ  ÖøÊñÊñ  Êô  ÊýÚ¾Ëü¥Ê·î  µî  Êñ  µý  ÀÐÊñ»å°©Êñ  "
	"Êý  ÌÀ  °©  Ãî  ÊÝ  ¸ÀÊý¶Êì±¡â  ¶â  ¿©ÊñÄ»  ÊþÄ»Ç·  ÐµÒ¾ÚÕ  Î©¥í"
	"ÅÚÊý½÷Êý¶ÒËÁË´¿´Ë´  ¸ÍÊý¶¦  Ë´²¦´ÅÊòÊðÊôÆüÌÜ»åÊý·îÊý×Å  ¸ÀË¿ì¸â¦"
	"³­  ¶âÌ¶Êý  ¥í¸¤µ¬ÊÇ¥³¥ÒÈþ  £ìÐ¦¹õ  Èþ  ÌÚ¥ÈµíÚ¾Î¦  ²Ó×Ä¶â¸ý»úÎÏ"
	"ÝÕ  ÝÆÂæ¶þ  ¹¸  ²ðÒÃÌÚ  ÈÖ±©ÑÜ  Ê¬»®Ëã¼êËãÀÐËãµ´ÖøÎÓÎ¤  ½÷Ì¤ÆüÌ¤"
	"ÌÚÚ¾ÝÙ  Î¤  ¿¿  ÇüÉÛÇü  ÌÚÕ÷µûÍ­ÌÚÀµµûÂºÁ¤  Ðµ¾®¥íÅ·¥ÌÐ©Ëö  ÌÚ  "
	"Ëö  ¸ð  ¿Ô  »åÃîËãÏ¤¥¯²¼ÒØ  Î¾  ÒØ  ÒØ  Ì¤  ÌÚ  µ´Ì¤¸Ê  Â¶  »³¹Ã"
	"ÕßÉ¬ÕßÉ¬ÁÕ  ¿ê  Ç°  ÇÉ  ½÷¾¯ÊÆÌÓ»á  ÌÜÌ±Ì·Ú¾Í¼  ºýÒÂ¥àµíÍ½¥ª±«Ì³"
	"ÉðÄ»ÌÚµþ½÷É¥½÷ÎÉÑÌÃ¶Í¼¥íÃ¡¹çÆü·îÌÀ»®ÊÆ  ¶âÌ¾¥íÄ»½÷»êµí¥Ò³¥Êê¥¯Ñº"
	"ÌÚÖç»åÖçÌÌ  ¼©É´ÇþÌÌÇü  Çü  Êê  Ë´½÷»Ò»®¤â¥âÌÒ  Ë´ÌÜ»åæ¨Ì¤ÌÓ²È  "
	"¿®½ô½½ÂçàÔ¹õÆü·îÌÚ¹©Ò±  ¿©ÖõÕ÷  ¸ÍÂçÊÆ¿ÏÀ¤³­Ìç¥íÌç¿´»åÊ¸F]  Ò±¿Ï"
	"¥»¤äÂæ  Ðµ  ÉãÌí¼ª  Î¤Í½Õõ  Å·  ÒÌ  ×ÆÝÕ¼Û  ³Ú  ¼Ü  Â­ð²Î©ÀÄ±¬  "
	"¿ô  ¸¯  Á°  Á°  Í³  Ìü  ¸ÀÁ°¼ÖÁ°¥íð²¥¤±¦Í«  ÃË  ¥ÊËôÍ­  Öö»³ÚÁ  "
	"°¦É´¼ª  ±¦·îÌÚÍ³Í¦  áµ  ½¶  ½¶¸¤ÅÄ  ¥Í±¦¥ÍÃ«¸À½¨Þâ  ÇÃ  ¿â  ¹­ð²"
	"ò¯Ãî¥¿¥¯¥ÞÃú¥Û  £µ¤Õ¸À  Ï»  Í½ÊÇÍÇ  ÖöÎÏ½÷ÔðÃ«  ÖøÍÑÚæ  ´Ì  ¿ä  "
	"Í£  Úæ  ÍÓ  ÍÓ  ÍÆ  ÍÆ  ·î¹Ã¶õæ¶²¦È¾¸÷ð²À¤ÌÚÍÆ  À¾½÷¸À´Ìáµ  ´Ì  "
	"Úæ  ¿©  Íß  °õ  Ã«·çÔð  Ã«  ±©Î©±©°ÛÄê  °Ý  Îß  ²Ì  Ì¤  Íè  Â«ÊÇ"
	"±«ÅÄ³Æ  »å³ÆÍì  ÆÓ³ÆÀå¤·±¬  É÷  ïìÜ¯´Æ  ´Æ  ïì  ¿Ã¸«²Ó¥ê»Ë¾æÕùÉü"
	"ÌÚ»ÒÍøÌÚ²¦Î¤²¦¶ÙÖøÍøÎ¤  ¥ÍÎ¤¹ÃÁá¶Ùð²ÀèÅÚææ  Â´ÖöÐµ¥ËÎ§  µþ  ÅÄ³Æ"
	"¶â  ½¼  Î±  ½¼  ÅáÅÄ½¼  ÊÆÎ©ÔéÀ¸²»¹ÃÎ©  Ï¤  éÈ»×ÊýTKéÈÃË¥ÕÐ­¾é  "
	"Ð·  ÑÄ»³ÀèÔéÐ·  ÊÆÅÍÛ´  µþ  óë  ÖøÐ·Ð·  ÀèÔéÎÌ  º±  ¸ÀµþÐ·  Ã¶Î¤"
	"ÀèÔéÎá  Åá¥Ê»å¥èÐÕ  ÒÌÎ¤ÌÚ  ÝôÎÓÊÆÁ¤ÎÓ  ¿ÃÉÊ¼ÖÐÕÊÆÁ¤ÊÆÁ¤¼¯Á¤Î±  "
	"Î¤  Ìá  ÅÄ»åÊÆÂçº£  Îá  Îó  Îá  ËüÎÏÎÎ  Îá  ²¦Îá¥Í¤·Îá  ¶âÎá´¾ð°"
	"±«Îá±«ÊÂ¼¯  »õÎáÒÌÎÓÒÌÎÓÝÆ¥ê¾¯ÎÏÎó  Îó°áÖø·óËò¿´ÊÆÁ¤Ï¢  ²ÐÅìÎ÷  "
	"»åÅìÁï  Ï¢  ¼Ö  ¶âÅì¥í¸ýµû  Ï¥  ²Ð¸Í³­³ÆÂ­³Æ±«Ï©ÎÏ  ½÷  ÖøÏº²¦×°"
	"ÎÉ·îÊÆ½÷Ïº  ÎÉ  Õù±«µí  ÎÉ  Îµ  ÅÚ¥ÒÎ¶¼ªÃîóëÎÉ  ÐµÈ¬¼¯  ¥Í¥è·îÎÏ"
	"¶â¥èÐÕ  °Ñ  ²Ó¥í¸ÀÀåÉÔÀµ³­Í­ÎÏ¡è°¿  ÌÚÒÀ½¢Ä»¸ßËüÃ¶  µûÒø¸ÀÂð¹â  "
	"ÒÐ  °¸  ×¿  °¸  °¸  ";

static const char *ro2 =
	"×µ  ÀµÒ±ÉÔ  ¥Ø£ì¤ê¥ë    °æ      ¥Î¡ÀÀéËÌÐª  Æý  £ì  ¾Ý  Áè  ¼ËÍ½"
	"Ð¡  Ãú¥¨][  ¹©µÛ°ì  ÐµÑÜµþ  Âð  ²ó³î¿Í^^Çµ  ÒÌ¿Í¥¤¥È¥¤¥«¥¤¾æ¥¤Åá"
	"¥¤¿Ï½ºÀé²ð  Ð¶  ¼º  ¸Å  Ê¦  ¶ç  Õà  ÕßÃúµÈ  Â¿  ¼ë  Âð  Ãû  Âü  "
	"É´  Í­  ÍÓ  ÌÚÐº¹çºýâ¸  ¸«  âã  ¿Í³î»Æ  ÌÈ  áµ  Î¤²ÂÍø  Äï  ¼Ö  "
	"´ñ  µï  ¶þ  Ñ»  ¶õ  Â´  µØÒÀ½Ç  ¾»  ÀÄ  Âî  ÈÜ  ÉÜ  Ìç  ÑÀ  Ò¹  "
	"¥³ËôÁ½¹ç³§  É§  °×  ¸Î  ¼Ô  ¹ú  ÑÁ  µ´  ¸ò  Àì  Ò¿  ÊïÚÄÌ¿      "
	"Àì  Ï¬  ´î  àª  ¶Æ  ÂØ  ÂØ  Æ¸  ìË  ÏËÅÄÑ¡  ð´  ÇÀ  ´Æ  ÀÆ      "
	"Ì´  ÉÊ  Æñ  Îï  ¸·      ¥ë  Ñ¹  ±±Ñº·»  ÌÈ  ¹î  ðï  ±«  Á°  È¬£µ"
	"ËÌ°Û¦£ ]ÑÄÌ¦ÒÁ  Í³ÑÄÑÄÆ±Í³·î¢ôÑÇÌÈ  °ì¢ÌÑÌÑ½ÑÌ¸µìµ  ±±¼ÛËë      "
	"Ôï  ¸ß  Ãæ  ¿å  ·»  Îó  ¸Ç  µþ  ãÉ  Ñ¹  éÈ½èÌÚÑÜÇ¤ÑÜ¹ÄÑÜ£Ì¡×ÑáÐ´"
	"¿Ï  ¥Á¥êÔï¥êÌÞ  µîÅáºý  Àå¥êÔò  Íø  ÖõÑãÖß  ¹î  Â«  ´ñ  °×  Á°Åá"
	"ì±  Ð«  è©  Áã  É¼  Ñ¡  Ñ¡ÑãÑ¡ÅáÑã  íä  ÀÆ  ¿É  ¿É  ¶çÎÏ¾¤ÎÏµÈÎÏ"
	"É×ÎÏÖß  µþÎÏ½õ  Ï«²ÐÀÕ  Áã      ×Ä  ·®      ð²  ¥Î¥ÕÌÞ¿Ï¶§Ò±ÅÄÒ±"
	"ÊãÒ±Ò±  ÔòÊñ¥Ò£ô£Ì¦£Ò¹¹ÃÒ¹½ÚÒ¹µ®Ò¹  ¡±£ÌÒ¹ÉÊ¶å½½×°ÀîÆû¤»×°½½½½  "
	"È»½Ú²¼Ðµ¦£|]Ìñ  ¥¿ÒÇÃ«ÒÇ´¬  ¥Î¡±ÒÌ×ÄÒÌÂ§ÒÌ²ÆÒÌ  ÒÌ»ÛÒÌÚÈ¥à  »²  "
	"»»  ÀÉ  ±±»ÙÆüËô    ¥íÃú¥íÅá¥íÈ¬¥íÆþ¥íÐ²¥íµí¥í²ç¥í¶Ô¥íÐ¶¥í¹¦¥í°ô"
	"¥íÆâ¥íÊ¬Ê¸¥í¥í¼Ü¥í±Ê¥í²ÄÔé¥í¥í¸¼¥í±»¥í¹Ã¥íº¡¥íÑÜ¥í¿½¥í³î¥íÅÛ¥í½Ð"
	"¥íÉÕ¥íÊñ¥í·½¥íËüØü°¿¥í»ê¥í¸ò¥í¶¦¥í¹ç¥í¼¡¼ÜÂþ¥íÀ¾¥íÂð¥íÏ·¸þ  ¥í¹Ô"
	"²Ä  ²æ  ´õ  ¸ã  ¹¹  ¹§  ¸¤  Êã  Ï®  ±÷  °µ  ²·  ¶õ  ð²¥íËô::Âî  "
	"±ê  ±±  Ç°  Ìá  ÏÃ  Âï  µÒ  ³Æ  Òù  °ß  Äë  ½©  ¼©  Ã¡  Ã±  Äë  "
	"Æî  ÑÁ  »É  Î¼  ±¨  ½­  º¹  ²Æ  Ï·ÆüÃî  âÃ  Ò¿  ÚÄ  ÀÕ  Â²      "
	"Ëã  Ï¢  Ôå  ´ï  ±Ä  º¡³Ñ»Û  Ä«  Ìµ  °Õ  ¶Ø  æé  ä®  ÉÊÌÚ¹â  Ç«  "
	"É¡  Î­          ±í  ¶¿¸þ±Å  ¸·  ´ï  ¼ß      »¨      éº  Â£      "
	"óö  ¥³ÑáÓø²½ÓøÎáÓøÊýÓøÍ­Óø¸ãÓø¹¬Óø´¬Óø°¿ÓøðêÓø°÷ÓøÀìÓø  ÓøÖàÓø°¥"
	"ÅÚÆþÅÚ²¼ÅÚ»³ÅÚ·çÅÚ¶ÔÅÚ»ßÅÚÉÔÅÚ´ÅÐª  ÂåÅÚÅÚÈéÅÚÉÕÅÚÊñÅÚ°çÅÚº±ÅÚ¹Ô"
	"ÅÚ»êÅÚÖõ¾å²¼ÅÚâãÅÚ³ÑÅÚÊãÅÚÀ£ÅÚÀ£ÅÚ°¡ÅÚ²ÖÅÚÂ´ÅÚÊþÅÚÀ¾ÅÚÓ¥ÅÚÚæÅÚÊÝ"
	"ÅÚ±¨ÅÚ²ÐÅÚ³¤±±ÝÕÅÚ»þÅÚÀµÅÚ»ÂÅÚÌîÅÚ´ÖÅÚµõÅÚÂºÅÚ±ü²õ  ÅÚÔ§ÅÚÃøÂÄ  "
	"ÍÊ  ±Þ  ±Ã  â¸  ×¢  ÉÊ  ËÏ  ÆÞ  ¾í  Î¶  ÁÔ  ÇäÐ³Æ¦  É¥·îÔä  ¿Ò  "
	"µ×¥¿Ôé      ¥èÝÆÎÓÍ¼²ÌÂ¿É×  Âç  Âç½½Âç£µÂç  Î©²ÄËòÂç»ÍÂçÂç·½ÖöÂç"
	"ÁÔÂç¼Ô  ½¶  ±ü  ¾­  Ò¿  ½÷´³½÷¼Û½÷  ¥¤½÷ÌÑ  ½÷Èæ½÷Ã¶½÷Êì½÷°ÐÍÓ½÷"
	"½÷×°½÷Ç¤Ãû  ²æ  ½÷·îº»½÷Æá  ½÷  ½÷ÃË½÷°¤½÷¿Ñ°¸  ¼è  ¼è  ÈÜ  ÎÓ½÷"
	"Èý  »®  ÑÊ  ¼å  ±±»Ù½÷ÇÏßá  Ò¿  ¾ï      É¼  ´Ö  ´×  ¶¬  ÓÅ  íä  "
	"ÃË½÷ÃË½÷½÷  É¡  Íê  ¾îê÷    Áú  Î»  Çµ»Ò»Ò  »ú  ÅÛ»Ò°ç  µý´ÝÖö»Ò"
	"Íñ  ³Ø  Ê¸»Ò¼û  Ðµ  Õß¥ÒÕß¿ÃÃ¤  ÌÈ      ð²  À§          ´Ó  ¿²  "
	"Çü  ±©×Ä±±¼Û°¥  ³­  ³­  ¹îÀ£¾­  Àì  ¶ÈÀ£¥±¾®¿Ó  Âç¶åÕ÷×ÄÒÌ  ÕùÖø"
	"ÕùÈæÕù  ÕùÊÆÕù³­Õù  ÕùÖõÕù  Õù  »³¥Ê»³¤·»³Åá»³¸ðµÚ  º£  Ê¬»³»³½÷"
	"»³Í³»³»á»³Çò»³Ê¿»³Ì±»³ÊÛ»³Àê¹ç  »³»û²æ      »³¹¹»³¾ÓÄ»  »³Ã«¡Ü  "
	"°µ  ²¬  Ôô  ¶â  ¶þ  º«  ð²  Áè  »³ÔéÐÕ  ÐÕ  ´Å·çÉÊ  ã¼  Èý  µ´  "
	"º¹  ¼å  Ò¿  »Â  ¾Ï  ¶Æ  ÅÐ  µÁ  Ñ¡  ¹ö  Î´  µ¿  çÐ      ò²  Å¿  "
	"    ¸·  <<  ¹©Ðº¸Ê  ¹¡ÇÃ»á¶Ò¥è¶Ò¶Ò¼ºÅÛ¶ÒÇò¶Ò    ¶Òð²¶Ò²°¶Òðê¶ÒÄç"
	"¶ÒÌ½¶ÒÔ¢ÒØ  ²»×µ¶ÒÆ¸ÚÈ¶ÒÉõ¶Ò++TT×°¡ô¥à  ËãÖöÐµÒÌÖøÍÓÖøÂ§ÖøÁêÖø²Æ"
	"Öø´ûÖøÝÖÖø×ÄÖø²«Öø»ÛÖøÀ£ÖøËÏÖøâ¤ÖøÌµÖø²òÖøãÈÖøâºÖøð²Öø  ÖøÄ°    "
	"×®Í³¥Ê½½×°  ×°              ¼°  µÝ  ÅÛµÝµÝ¼ªÊþ  Ó§  ÃÆ  ¼¤  ¸ÀµÝ"
	"ËòµÝ¥è¥æìµ  ¥è  ×À²Ì¥Î  µÈ×Ä¥¤  ×ÆÊý×ÆÀ¸×Æ³î×ÆÊ¦×Æ²ó×Æº±×ÆÖß×Æ½Ü"
	"×Æ  ÅÌ  Èó  ×Æ  ×Æ¹Ä×Æ´Ì×Æ  À£  ¶Ô  ¸á  ±¯  Õ÷  Ôð¾®Ä¾  Ê¬¿´Âæ  "
	"ºß  ¸Å  ¶ç  Æô  Æã¿´Ò²¹úÃ¶  Çò  Ê¦  Ê¿  ±û  ±Ê  ·½»ÖÇ¤¿´³Æ  µÙ¿´"
	"Ò³  ÎÏ¡è¸ß  ¸÷  ¼¡¿´»û  ·ì  ½Ü  Àå  Æ±  ÍÓ¿´·î  ÚÝ  ¶ñ  º¤  Â«  "
	"¾Ó  °ô  »ú  ÌÈ  Í¸  Íø  Òç  Ð³¿´µ¨  ·Ã  ´¬  Â´  ÒÀ  ºÊ  ¼þ  Ä¹  "
	"æ¨  »®  Òø  Þ§  ¹Ä  ½Õ¿´½©  ¼©  À±  Àë  ¹ú  Â§  Öß  Ì±Ú¾ÆüÔéÝÖ  "
	"µ¤  ¹ò  µ´  ·ó  ¸¶¿´âÃ  ºó  ÁÒ  Àì  Í°  ·ª  ·ø  ¹¯  »²  »Â  »Â  "
	"½¾  ½¬  Úæ  Â¤  Àì  Æ°  Æ¿  É¼  ÍÇ  ´î      Å¼  ·Ê  ¾Ç  ÓÅ  È÷  "
	"ÇÏ  ïÜ  Ìµ  ¹¬  ±ü  ´ç  ²û  ²ò  ¶Ð  ÉÊ  ¸À  ÎÓ  ð²  ãÈ  ¼û  Ëþ  "
	"Íê  ºÏ  ºÏ  ×ó  ð²  âÚ  æã  Îø  ×µ  Êê  Êê  Êê  Øù  Øù  Øù  ¿ÓØù"
	"ð²ØùØù  Àï  µº  Øù  ¸Íºý¥­¤·¥­´³¥­¥í¥­¹©¥­ºµÅá  Ìñ  ²¦  Ôï  Øù  "
	"Í½  ÄÞ  ÅÍ  È´  ²¼  ÉÔ  ÍÄ  ´Å  ¿½  ÅÛ¼ê¹ç¼êÀÞ  ¸À  Àê  ÇÒ  È¾  "
	"ÉÕ  Ê¦  Êì  ¶åÎÏÎ©  ³Æ  µÈ  ¶¦  ±©  ·½  ¼ê  ¾ç  Â¸  ¥í·îÔó  ÚÝ  "
	"±±»ÙÆüÅÚÌë  ´ñ  ¶Õ  ¼è  ¿â  À©¼êÒ±  Âî  Äê  Ì¿  Ìç  Ìá  ìµ  ³§  "
	"Åì  â£  ¼©  ½À  Àé±±Ìí  ÑÁ  Í¼´Ì´¨·ýÑÊ  º¹  ¼å  ÁÒ  æã  Åç  ±©  "
	"Àì  ÖÃ  ¼¹  Àì  ±©×Ä³Ð  »Û  ô¡  â¤  Ð·  Ò©  ´¶  ìµ  ¶Ù  Ð¹  ¹¬  "
	"Ã£  íä  Íë  Ùß  çÐµóçÐ¥­ÀÆ  ¼¼  Âæ  Ôè  ÉÐ  Í÷  Àý  ×¢  Å¢  Èí  "
	"µó  ³ÚÜÛê÷  ÖÃ  »¿  Æñ  »å¸ÀÀÉ  Ëô  Ëô¥±Ú¾  Ú¾  ¥¤Ú¾ÅÄÚ¾¸òÚ¾Êü  "
	"Â«Ú¾Í¾Ú¾Í¾Ú¾¾°Ú¾¶ÒÚ¾¹âÚ½¿ô  Ñ¡Ú¾ÚÉ»à»å¸À³ÑÅÍ¿ÓÅÍÀÐ¶ÔÃÇ  ÊýÃ°Êý»Ô"
	"ÊýÎ©ÊýÌÓÊýÀ¸Êý½¼ÊýÈÖÊýÈÖ¥Á¥âÚÛ  Áá´³Æü  ÆüÅ·ÆüÐ¼ÆüÊ¸ÌÚÆüÆüÆô±Ê  "
	"Æü±¬ÆüÌÞ°Â  Æü¸÷¿¸  ÆüÃûÆü´õ½ñ  Æü¸ãÆü¹ðÆüÃ¤ÆüÀ®ÀÞ  ÀÏ  Èó  ·³  "
	"±Ñ  ·³  Àë  Úæ  Ì½  Ã¶  ¿Ê  ô¡  ÆØ  ÚÉÆü²Ú  Ð·  °¦  ÌØ  ×¢  ¹­  "
	"µÁ  ¶¦  £Å¸ý¿½ØùÆüÆ÷·î½Ð·îÎÉÂ¶  ÌØ  Î¶  ±«¾ä¥Û  »ÔËöÇµÌÚÌÚÆþÌÚÎÏ"
	"ÌÚÅáÌÚ´³ÌÚ¸ÊÌÚ¹©ÌÚ×µÌÚ»³ÌÚËüÌÚ²¦ÌÚ  ÌÚ¸øÌÚÍ½ÌÚ¾¯ÌÚÊ¬ÌÚÊýÌÚ¸ÍÌÚ¾£"
	"ÌÚ×°Û¶²ÃÌÚ²ÄÌÚ²ýÂ«  ÌÚÂþÌÚÒ¹ÌÚ¶çÌÚ³îÌÚÆãÌÚÀÍÌÚ»áÌÚ½ÐÌÚÊñÌÚÉÕÌÚÎ©"
	"ÌÚ±»ÌÚÁ½ÌÚ´³ÌÚ¶©ÌÚ±©ÌÚÁ¤ÌÚÔòÌÚ¹ÍÌÚ»êÌÚ½¼ÌÚÂ¸ÌÚÌ¶ÌÚÅöÌÚ³ÑÌÚÚÝÌÚÄ»"
	"ÌÚ¹ðÌÚ°ôÌÚÖâÌÚÚÁÌÚÆáÌÚÄîÌÚÔèÌÚÊ¼ÌÚÕÕÎÓËÞÌÚÏ¤ÎÓ²¼ÌÚÐ³ÌÚ¼·ÌÚ·¯ÌÚµý"
	"ÌÚÂ¶ÌÚ¼ÛÛ³  ÌÚ¹ñÌÚ·ôÌÚ²¬ÌÚ¶õº«  ÌÚºªÌÚØýÌÚ½¡ÌÚ°ôÌÚ½ÇÌÚ¾ªÌÚÛ³ÌÚ  "
	"ÌÚÃÎÌÚÂîÌÚ¾°ÌÚÇ°ÌÚÉÜÌÚÊÂÌÚÌçÌÚÅµÌÚ»êÌÚÐÕÌÚÇµÌÚ³§ÌÚ¸ÕÌÚ½©ÌÚ¼ªÌÚ·À"
	"ÌÚÀôÌÚ¼ÔÌÚ¿ÓÌÚÄëÌÚìµÎÓÌ·ÌÚÌíÌÚÑÁÌÚÊýÌÚÛËÌÚ¼¼ÌÚÀ¤ÌÚ»®±É  ÌÚµ´ÌÚì±"
	"ÌÚ¹âÌÚ¹×ÌÚ¹üÌÚº¹ÌÚ´¨ÌÚºóÌÚÅçÌÚ±©ÌÚÈÌÌÚÈÛÌÚ²ÐÌÚÀìÌÚÌ½ÌÚÚÕÌÚÍÆÌÚÎ±"
	"ÌÚÎµÌÚ³Ô³Ú  ÌÚ×ÄÌÚ·½ÄÇ  ÌÚ»©³ÑÅÍÌÚ»ÂÌÚ½¾ÌÚ¿êÌÚÒ¿ÌÚÀÌÌÚÁãÌÚÀìÎÓÂç"
	"ÌÚÌ©ÌÚÌªÌÚ±ÊÌÚÏ¬ÌÚ´ºÌÚ´ÓÌÚ´îÌÚºÇÌÚ¾½ÌÚÝÞÌÚç¡ÌÚÅÐÌÚÆ¸ÌÚô¡ÌÚÈþÌÚÄ»"
	"ÌÚ¸ÀÌÚ°ÕÌÚ·ÉÌÚÊüÌÚÑ¡ÌÚÔ§ÌÚíäÌÚÝ¡ÌÚ´ÑÌÚÒ¼ÌÚð²ÌÚÇ«ÌÚÉÐÌÚÌØÌÚ±ïÌÚÉÊ"
	"ÌÚÜÛÌÚ³ÚÜ¯ïãÌÚÎòÌÚ±ÅÌÚÚ©ÌÚ  ÌÚ±«ÌÚ¸ÀÌÚÍ÷´Ì×ÄÌÚ´Ñâã·ç´õ·çÅð  ´ñ·ç"
	"°û  ·ç  ±±·ç·ó·çÒ¿·ç±©·çµõ·çÑ¡·ççÐ·çð²·ç»ÕÖäÍ¼ËüÝÆËôÝÆÔðÝÆ×ÄÝÆ±û"
	"ÝÆÕÕÝÆØýÝÆÎ©ÝÆ°÷ÝÆÚæÝÆÔåÝÆÓÅÝÆÉÐÝÆ×µÝÆ×µÑÜËôÝÕ  ÇäÝÕÒ¿ÝÕ±¯¡ôËè½¼"
	"¾¯ÌÓÌÓµáÌÓ  ÌÓ  ÌÓ±êËãÌÓÐ¹ÌÓË´Ì±¡á¤·ÝãÊ¬Ýã°øÝãÊÆ¹©¿å»³  ÅÚ  ²¦  "
	"¶Ô  ¸ß  »ß  ¿´  »Ô  Ê¬  Æü  È¿  Ëô  ÌÚ  À¤  ±û  ¹°  ¸Å  »Í  °ø  "
	"ÀÍ  ³î  Õà  Àê  ÅÄ  Ë³  Ì±  Ê¿  ÌÜ  °Ð  ¹ÔÄõÒ³  ·ì  ¹ç  ¸÷  ¼ë  "
	"½Ü  ÆòÇ¡À¾  Îó  ´°  ·î  ¹¨  °ô  Ôó  ÀÞÝë±ä  Äï  Ôè  ÆüÅÚ±â  ¥·¥ê"
	"ÊÆÀîÈ¡  Â¶  ¶â  ¸Ç  ºè  Â´  Ýô¾¾¾°  à§  ºÊ  ÝôÀÏØý  ½¡  ±÷  ÅÚÑ¹"
	"ÐÕ  ½Ú  °ß  À¾ÅÚ²×  Ôö  à©  ¹Ä  ·³  ÝôÃ¶½©  ÝôÝõÀô  ¼©  Äâ  ÇÒ  "
	"Þ¥º»ÌÌ  ËÖ  Ëþ  ÑÁ  Êý»Ò»É  âã  Ë¡»®¹¸Þ«Óø  ºË  ¿«  ºó  ÁÒ  Ò×  "
	"±±  ·îÂÙÅâ  ±ºÀìµãÚÕÌ½  º¢  ´û  ÞÎ  ÎÞÍ¸µö  °¥  Õò  »²  Â«·çÂÓ  "
	"Ä¥  Ûê  ±Ë  ¶§¥àóÃ  ô¡  Õù  ¥Û·î»ß  »ß  ¿Ò  Àø  Àø  Áá  ¹¶  Æ¸  "
	"ÈÖ  ×Å  °¡  Î÷  Ð·  ±ü  ´´  ÝôÉÊ¹¬  ¸À  ³­  Îí  ÀÆ          ¼¤  "
	"Ç«  ÉÐ  ËÍ  ÌØ  ÑÐ  ¿³  ìÍ  Ë½  ÍÜ  Î­  Î¸      ´´  Ãö  Îò  âº  "
	"æé  ß¾×½ïì  ÚÌ  ¹÷Îï»å¸ÀÍ¼²Ð²Ð¾¯²ÐÑÄ²ÐÑÄ²Ðµð²ÐÆã²ÐÊº²ÐÊñ²Ð°øµÙ  "
	"²Ð¾ç²Ð³ÆÀµ  ²ÐÔé²Ðº«²ÐÎ©²ÐÔöµðÌ¦ßæ  ¶ç  ²Ð  ²Ð¹Ä²Ðà©²ÐÚæ²Ð½Å²Ðßí"
	"²ÐÂ©²Ð¹×²Ð°ÓÚÄ  ²ÐÌç´î  ²Ð×µ²Ðô¡²ÐÆØ²ÐÈÖ²ÐÐ·²Ð±ü²ÐÔÌ²Ð¿ë²ÐÃ£²Ðâ¸"
	"²Ðìµ½¬ð²²ÐÜÛ²Ðâº²ÐïìÊ²  ¥èÕúÄÞÇÃÍ§  °Ù  ¥áÐ©à«³î=|  à­  à­Ô§ÊÒØý"
	"ÊÒÇãµí»áµí¸ãµí²ÓÍøµíµí¡èµí¹âÏ´  µíÇãµíµÁÌà  ºÍ  ±¯  Ãæ  ²Ð  ¹Ã  "
	"Ê¦  ³Æ  º±  ¸ò  ¶¹  ¥í·îÚÁ  ´ñ  Ñ»  ÀÄ  ¾»  Â´  ¸ô  ¼©  À±  °Ú  "
	"¹ü  Õò  Çü  ¹õ¸¤ÒÐ  Á½  éæ  Ç«  ½Ã  ÁÍ  ¸¤  À¥  ²Ã  Âå  Õõ  Èé  "
	"Çò  ¼ª  Âü  ³Æ  °¡  ÎÉ  Ïº  ¸×  ¸ã  Èó  Ë¡  ¥³Ëô·³  É¬  ¶§ÖßËÁ  "
	"ÑÁ  Êõ  µ´  ²¦³­ÇÏ  ²¦´Ì¶Ï  ¾Ï  Èþ  íä¶Ì²Æ  Î¶  àþ  ½÷  Ôò±»¿É±»"
	"´¤½½´¤Àé´¤¸ø´¤ÆÖ´¤Ê¬´¤ÌÓ´¤É´´¤»Ñ´¤À¾´¤½©´¤ÎÒÒ¿´¤Àì´¤Ì´´¤´¤  ´¤  "
	"¾°´Å¹¹À¸¥ÞÍÑÅÄÃú¥ÄÅÄÅÄ²ðÅÄ°æÅÄÉ×ÅÄ×ÄÅÄ¥àÅÄ¥àÅÄ°áÅÄ»þÅÄ³ÆÅÄ½ñÅÄÍ¾"
	"ÅÄ´ñÅÄ¾°¶°  ÅÄÔèÅÄ¼÷¾ö  ÅÄ  ÎÝ  ÖøÃúÖøµ×Öø»³Öø²ðÖøÌàÖø²ÃÖø´ÅÖø¸¼"
	"Öøº¡Öø³îÖøÃ¶ÖøÅßÖøÊñÖø°ÐÖøÁ´ÖøÍÓÖøÖßÖø»ÖÖøÈÝÖø°¤Öø°ÑÖø¸ÇÖøÂ´Öø±ê"
	"ÖøÈÜËã  Ëã  ÖøÉ÷ÖøÚæÖøÑÁÖø»®ÖøµÔÖøÀÔÖøÁÒÖøÈÌÖøÎ±Öø¾ÏÖøÎßÖøºÊÖø´Ö"
	"Öøâ¤ÖøÒ©ÖøÅÂÖøèßÖøµ¿ÖøÍÜÖøð²Öø  ÖøÀÑÖøÎòÖøÁ¯Öøð²ÖøÅ¿    â¢Å·â¢ÝÕ"
	"Çò¥ÒÇòÑ¹ÇòÈ¿ÇòÂçÇò¸òÇò´°Çò¹ðÀÏÇòÇòì±ÈéÊñ°ôÈé·³ÈéÈé·³çíÈéÐ²»®µî»®"
	"ÍÓ»®¹ç»®Øý»®ææ»®¿å»®éÈ»®Åò»®Æ¢»®ÌÜÑÂÌÜÕ÷ÌÜ¾¯ÌÜ  ÌÜ¸¼ÌÜÆô»Ý¶ñº¡ÌÜ"
	"ÌÜº¡ÌÜÌ¤É×ÌÜÌÜÌ¶ÌÜÄïÌÜ°µÌÜÑ»ÌÜÁöÌÜÀÄÌÜÈÜÌÜ  ÌÜ¹¬ÌÜ¼ÔÌÜÀåâÃ  Ì½  "
	"Æ²  ÌÜ  ÌÜ´ºÌÜµ®ÌÜ°¦ÌÜð²ÌÜÑ¡ÌÜ¸ÝÌÜ¸ÀÌÜÌØâÚÀÉÄ¾ÉÊÌÜéæÌ·º£¥àÌðÌð°Ñ"
	"ÀÐ¹©ÀÐÀÚÀÐÈæÀÐ×¢ÀÐ³îÀÐèßÀÐ·½ÀÐÂ´ÀÐ²ÖÇÈÀÐÀÐÊþÀÐÎ©ÀÐ×ÀÀÐÆüÀÐÄçÀÐ¿Ó"
	"ÀÐÖßÀÐì±ÀÐ¹üÀÐº¹ÀÐÁ¤ÀÐÅ¸ÀÐÇÏÀÐÚÕÀÐÉÊÀÐÀ¼ÀÐÀÕÀÐÀìÀÐô¡ÀÐÅÐÀÐ±üÀÐµÁ"
	"ÀÐáÄÀÐµ¿ÀÐÎÓÀÐÜÛ¼¨Ì¦¼¨»Ê¼¨»á¼¨½Ð¼¨Æã¼¨É¬¼¨×µ¼¨Â¶¼¨×À¼¨·À¼¨°ô¼¨´î"
	"¼¨ÀÆ¼¨ÓÅ¼¨Ë­¼¨ê÷Ãî  ¹ÃÃîÀé¥è²ÓÈæ²Ó±û²Óµð²Ó  ²ÓËö²ÓÚÝ²Ó¾Ó²ÓÂ¶²ÓÄ¾"
	"²Ó¼þ²Ó²ó¼¨²ó²ÓÑÇ²Ó±±²Ó¹â²Ó°ô²ÓÍÆ²Ó·Ã²ÓºÔ²ÓÔ§²ÓºÐ²ÓµÞ²Óµµ²Óê÷·êµÝ"
	"·ê°æ·êÍÄ·ê¥¿·êÃû·ê·¯·ê¹ð·êÓ¥·ê  ·ê´Ì·êºÊ·êÊü·êÁÍ·êÎ´·ê¿ë·êìÎ·ê²Ó"
	"Î©½½Î©ÀéÎ©Ê¬Î©ÌÓÎ©ÀêÎ©ÃúÎ©  Î©É´Î©âãÎ©Â«Î©°×Î©ÎÒ´Ý  ÌÞ  ÄÞ  ÇÃ  "
	"²Ã  Àê  À¸  Âæ  ÈÅ  ËÜ  Ìð  ¶©  ãþ  Öô×°½Ü  Õú  Á´  Àè  ±ä  Ï¤  "
	"Ôó  ¸«  ºî  ÚÁ  À®  Öà  Ùº  ¶Ý  º«  µñ  ¶õ  Åú  Øý  Öä  à§  Áè  "
	"Éþ  Ôó  ¹Ä  ¸ô  ´Å·çÒù  ìµ  ÑÊ  »Õ  ¿ê  Ì¬  º«  ·ª  Î¶  ÀÕ  Â²  "
	"Ä¦  É­  °©  ÎÂ  ºÊ  ßá  µ®  ²«  ÂØ  À¾Áá¸À  æé  ÅúÑ¡Ôè  ´Æ  ¿ô  "
	"´ú  Î±  Þî  Þî  Íê  Èµ  Èµ  óþ  Î¥  ÊÆ½½ÊÆÈæÊÆ¸Í±üËüÊÆ¹ç¼¡ÊÆÊÆ¼©"
	"ÊÆÆ±ÊÆÉ´ÊÆ¹¹¥¿ÊÆÊÆÎÂÊÆÎÉÊÆÂ´ÊÆ½¡ÊÆ²ÖÊÆ½ÀÊÆ¿ÓÊÆ²ÈÊÆÍÑÊÆËãÊÆÇü´¡  "
	"ÊÆ¼ûÊÆèßÊÆ»¨ÊÆ  »å¤·»åÐ²»åÀ£»å±¾»åÈæ»åÊ¸»åÑÄ»å¹­»¥»å»åÀ¤»åÂæ»åÃú"
	"»åÈ¾»å¥ð»å¸÷»å¹Ô»å  »å½¿Ç¡»å»å±È»åÖõ»åÖß»å½¨»åÚÁ»åÂÅ»åÏ¤»åÇ¦»å´ñ"
	"¸Í»å»å´¬»åºÓ»åá·»åÂî»åØý»å²¸»å¼þ»å´ÌÖç·Ï»åÐÕ»åÌá»å´±»åÒù»å¼ª»åÀ¤"
	"»åÃÊ»åÃ×¼Ó  »åºª»å°Ò»å±×¸©·Ï»åºË»åº¹½Ä  »å¿«»å¿¸»åÄÉ»å  »å×Ä»å¶¯"
	"Ëã»å»åÒØ»åÉ¼»åÊø»åÏ¬»åÎß»åÏ¢»å±À»åÌç»å»¶»åô¡»åÈÖ»åÐ·»å¹¬»åÁ½»å  "
	"»å·Ñ»å¼û»åÀÆ»åÀÆ»åÉÐ»å¿É»å´Æ·ëÊÇ»å»¿»åìÎ»åËÏ¹ÊÊÇ»å±Å»åÌÈ»åØù»åØù"
	"ÆÇ»å»åÍ÷´Ì¹©´ÌÔï´Ì  ´Ì³­´Ì  ´ÌÆÞ´Ìð²ÑÄ¥á´³  ÑÄË´ÉÔ  ¸Å  Ì±  ±â  "
	"Âî  ÎÓ  Æ¤  ¸¨  ·§  Ëë  ³×ÇÏ³×´ñÍÓÑºÍÓ  º¹±¯ÍÓ»áÍÓÎáÍÓ·¯ÍÓ  ÍÓ  "
	"ÍÓÈþÍÓÈþÍÓÐ¹ÍÓ  ÍÓ¸À»Ù±©ÒÀ±©Î©±©¹ç±©ÍÓ±©Èó±©Á°±©Ù¨±©²¥±©ô¡±©ÈÖÈô"
	"Ï·»ÝÏ·ÌÓÏ·»ê²ÓÌ¤æÐ±¾æÐÇÃæÐÏ¤æÐ½õæÐ¿«¼ª²Ð¼ª»ß¼ª±¬¼ªÎá¼ªÀå¼ªÍ³¼è  "
	"ÃÎ¼ª¼ªÄê¼ª×°½¾¼ªÀ¼¼ª¼ª  ¼ª  ¼ªÇ«¼ª  ¥è¥­¥ÒææÄ¹ææææÀî·î¹©·îË´·îÅÚ"
	"·îÆâ·îÆü·îÌà·î¹Ã·îÉ¥·îÆã·î»á·îÍ³·îÐ£·îÈ¾·î±Ê·îÔò·î¸÷·îÖß·îÚÁ·îÃ¤"
	"·îÊã·îÌë·îº¸·îÅµ·îÈÜ·îÈó·îÉÜ·îÖõ·î·ú·î»×·îÀ±·îÖß·îçÌ·î»®·îò¯·îÀì"
	"·îÚÕ·îÎ¹·îÖß·îÔ¢·îÀã·îÃâ·î¼¼·îÚæ·î¹×·îÈÖ·îÂ´·îÁ½·îº¸·î¸À·îÅÂ·îíä"
	"·î´ç·îÑ¡·îÀÆ·î¼û·î±í·îÁÍ·î³ë·îâº·îÂ¢»åÆù¿ÃÊê¼¼  »ê¿Á±±¿Í±±×°±±½Õ"
	"±±ÃË±±Ï»±±ð²¹çÀåÀå»áçÒÊã½®¸ø½®Êý½®²Ä½®Í³½®ÕÕ½®ÁÒ½®Ò×½®Àã½®Áâ½®Æ¸"
	"½®µÁ½®Ô§½®ÌØ½®Ï¥½®âº½®¸Í³×º±Ë­¿§Ö¥  ++Ð©¼Û  Ë´  ¸µ  ÝÕ  ¼Û  Ê¬  "
	"°Ê  µð  ¶ç  ÑÇ  ³î  Åß  Êì  Ëè  ÈÅ  ÉÕ  Ê¿  Êñ  ±¬  ÌÜ  Ëö  Î©  "
	"°ø  ²ó  ³Æ  Öö  ¼ë  ½Ü  Ç¡  Â¸  ¹ç  Éú  çê  Ì¾  Åá¡è°Ì  ±ä  ²æ  "
	"´Þ  Ôó  Öß  ¸â  º»  ½õ  Ôã  Í¾ÃãÅÆ  Æ¦  Ç¦  ½¨  Íø  ÎÉ  ±â  Àë  "
	"Ãæ²¦º«  ½Ç  Â´  ¾¾  ºÊ  ÀÄ  Öä  Ä¹  ÇÈ  Èó  Þ¤çùË¢  Êþ  Âç×°çÌ  "
	"Î¿  ÎÓ  £Å¥³²Ê  Òø  Òø  ´§  ·³  ¸Õ  çí  ÃÊ  Äë  ÇÃ  ÊÝ  ã¼  Ìó  "
	"»Ü  Ó¥  ²§  ÂÀ»®·ó  ¹â  çþ¶çºÂ  ÃøÏ·¼å  ½¤  ¿«  ¿Á  ÀÊ  º«  ÚÕ  "
	"º×  ½É  Àì  ½î  »²  ÁÁ  Â²  ÂÓ  Ò¶  ±©×ÄÛù  ½Ø  ô¡  Áá  ¿Ò  ¿´  "
	"»ß  Í±  ²¹  ÝÆðìÁ½  ÏËÅÄµû  Ì´»àæé  Ô§  ¿É  Ï¬Ú¾Èù  íä  ÍÂ  Íë  "
	"ÎÇ  æÐÀÎÀÆ  Â¢  ¼¼  ËÆ  æÐã¼·Ý¼¹ÜÛ  óÕ  ±Ú  é¥  ²ÓµûÉÑ  Íê  Ìçð²"
	"âº  Î¶  Á¯  åÜ  Íå  ¾å¼·¶Ô»ÔéÈÊ¸¹æ¸×éÈ±øÃî  Ãî°úÃî¸øÃî»³ÃîÅÍÃîÆâ"
	"Ãî¥­Ãî´ÅÃîµÖÃî¸ÅÃî³îÃîÍ³ÃîÎáÃîèßÃîÊñÃî²óÃîÀåÃîËÞÃî¶¦Ãî¸òÃî¼ëÃîÏ·"
	"Ãî±äÃî¸«Ãî¸âÃîÒ±ÃîÃ¤ÃîÑ¼Ãî±äÃîÕÕÃîÍ¾ÃîáµÃîÍøÃî°×Ãî°¸Ãî´¬ÃîÀÄÃîÀÏ"
	"Ãî¼þÃîÈóÃîÅÄÃî°ßÃîÓ¥Ãî²ÊÃî°×Ãî¸ÕÃî¹ÄÃî¥ÊÃîÔéÃîÙ¨ÃîÑÁÃî»ÒÃîÚæÃîóæ"
	"·Ö  ÃîÌ½ÃîÏºÃîÚÄÃî¼½ÃîÅßÃîÎ¨Ãî¾ïÃîð²Ãî¼ÏÃî¼¹ÃîÆ²ÃîËëÃîÇüÃîÏ¬Ãîô¡"
	"ÃîÉÊÃîÈÖÃî²òéù·çÃî¸ÀÃîÀ»ÃîáÄÃîËÛÃî  Ãî±ÉÃîÀÉÃî¼ûÃî½ÕÃîìµêµ»®Ãî  "
	"Ãî  Ãî  Ãî»å·ì±¯·ì¿Ï¹Ô¸¼¹Ô¸ã¹Ô  ¹Ôð²¥Í×Ä°¥  º£°á°¥  ¥ÍÆü¥Í¿ÑêÓÇ¤"
	"¥ÍÆâ¥ÍÔï¥Í×Ä¥ÍÃ¶¥ÍÕõ¥ÍÇò¥ÍÈ¾¥ÍÊñ³ý½ÀÊì°á¥Í·½¥ÍÉú¾å²¼¥Í¹Ô°áÑÈµá°á"
	"¥Í·¯Ôã°áÎ¢  êß·µ¥Í°×Èó°á¥ÍÈÜ¥Í¶Ò¥ÍºÊ¥Í·³¥ÍÙ¨¥ÍÊÝ°á  ²¹  ¥Í¿«¥ÍÂà"
	"¥Í¸×¥Í¶¯É½  ¼¹°á¥Í½¬¥ÍÏ¬¥ÍÓÅ¥ÍÃ±¥ÍáÄíä°á¥Í¼û¥Í´Æ¥ÍµÈ¥ÍÊÎ¥Í¿Æ¥Íïì"
	"¥ÍÚ©ÑÌ  ë¨Ááë¨Êüë¨ÇÏ¸«  ¸«Àê¸«Öà¸«¼Ô¸«ÑÁ¸«ì±¸«ÑÊ¸«  ³Ð  Í÷  ¸«ìÎ"
	"¸«ð²³Ñ±»³Ñº¡³Ñ»á³ÑÍÓ³ÑÚæ³Ñéæ¸À¥È¸À¸ð¸À´³¸À¹©¸À²½¸À²ç¸ÀÆâ¸À²Ä¸À¸Å"
	"¸À³î¸ÀÂæ¸À»á¸À  ¸À³¥¸À´í¸À¹¡¸À½Ü¸À¼ë¸ÀÃû¸ÀæÐ¸ÀËè¸À²ü¸À¶¸¸À¹ð¸Àáµ"
	"¸À¾Ó¸ÀÖà¸Àµý¸Àà§¸À±±¸ÀÄê¸ÀÛË¸À²»¸À³§¸ÀÒø¸Àðê¸ÀµÔ¸ÀÀë¸À·³¸ÀÉ÷¸ÀÙ¨"
	"¸ÀçÌ¸ÀÓ§¸À´¨¸À±×¸ÀÑÂ¸ÀÅÄ¸ÀÉ¬¸ÀÚÕ¸À´Ì¸ÀÒ¿¸À³×¸ÀÀ¼¸À¾¦¸ÀÒØ¸ÀÇü¸À²Ú"
	"¸Ààª¸À´ö¸ÀÌ·¸ÀÅÐ¸ÀÂØ¸ÀÂØ¸ÀÁá¸À  ¸ÀÉÊ¸Àíä¸À¹¬¸À¸¯¸ÀçÐ¸ÀìÎ¸À±íð²Ã¯"
	"¸ÀÌÈ¸Àê÷¸ÀØù¸Àð²¸À»¿Ã«²ç³²Ã«Ã«  »³Æ¦Æ¦°¸·øÆ¦Í©Æ¦ÉÔÎ»ìµ·ýìµ¼Ô×Ä  "
	"ì¸ºÍì¸¾¤ì¸³Æì¸µÙì¸É´ì¸Î¤ì¸Ñ»ì¸Èæì¸Èæì¸Çü³­Øù³­½â³­º£³­Âæ³­º¡³­Æõ"
	"³­Æõ³­Ë³Çã  ³­  ³­ØýÇã  ³­ÐÔ³­´¨³­·ó³­Àì³­¼¹³­ÚÄ³­»¿³­Éð³­ÌÕ³­¸À"
	"³­â¸³­ÀÆ³­Êê³­¾±³­ÉÊ³­ìÎÀÖÈ¿ÀÖ¼ÔÇ·  Áö£´ÁöÄÁÁö¾ÓÂ­»ÙÂ­»ßÂ­É×Â­²Ã"
	"Â­ºýÂ­ÀÐÂ­¼ºÂ­ÈéÂ­¸¤Â­´íÂ­ËÞÂ­º±Â­ÀèÂ­¶ÉÂ­Â«Â­ÎÉÂ­ÁöÂ­²ÌÂ­µïÂ­Øý"
	"Â­ÃÎÂ­½ÀÂ­½ÅÂ­ÑÁÂ­Í¦Â­  Â­´¨Â­º¹Â­ÁÒÂ­ÀÔÂ­±±Â­ÀÌÂ­½¾Â­½îÂ­½¡Â­Î¾"
	"Â­É­Â­ÒÐÂ­ÂºÂ­ÈþÂ­ÉÊÂ­ÃøÂ­éæÂ­íäÂ­ÀÆÂ­ÔèÂ­¼ÁÂ­Å¢Â­¿ÐÂ­ÌçÂ­í¸Â­æã"
	"¿ÈµÝ¿ÈËÜ¿ÈË­¿ÈÛ´¿ÈÈþ¿È´ç¿ÈØæ¼Ö¤·¼ÖÌñ¼Ö  ¼Ö¼º¼Ö²Ä¼Ö×Ä¼Ö¼°¼Ö»ê¼Ö³Æ"
	"¼ÖÖß¼ÖÌí¼Ö¼è¼ÖÌÈ¼Öá·¼ÖËô¼ÖÎ¾¼ÖÎ¾¼ÖÉ×¼ÖÁÕ¼ÖÅÄ¼ÖÔé¼ÖêÏ¼Ö¹ò¼ÖÅ¸¼ÖÀã"
	"¼ÖÀì¼Ö¼¯¼Ö¶¬¼Ö´¶¼Ö¼û¼ÖÜÛ¼ÖÎò¼Öâº¿É  Õù¿É¿ÉÂ«¿É  ¿É¸À°ì  Ãæ  ÑÄ  "
	"¾Â  Í³  ³°  ¼¤  ²ó  ¹¡  Ëò  À¾  µá  ½ä  °ô  ¾Ó  Äè  ²Ð  ±º  Íá  "
	"°Ñ  ÅÚÑ¹¿É  Öõ  ³é  ¥³Ëô¹Ä  ½¶  ÆÓ  Äç  ÑÁ  Æî  ÑÊ  ¸×  ÚÄ  ÆÚ  "
	"ô¡  ç¡  ºÔ  ²ò  ßÉ  èß  ·ã  ÊÕ  ÊÕ  Íå  ÆÖ  ´Å  µÖ  ¾¤  Äè  Ã«  "
	"¸ÍÇÃÕÕ  Òø  çí  ²ó  ÓÅ  ÊÆÁ¤ÆÓÃúÆÓÕ÷ÆÓÝÕÆÓ´ÅÆÓ²ÓÆÓÌ¾ÆÓ°éÆÓÄèÆÓÀÎ"
	"ÆÓÂ´ÆÓÎÓÆÓ»®ÆÓ°åÆÓ»®ÆÓ×ÄÆÓìµÆÓË­ÆÓßíÆÓê÷ÆÓ  ²ÓÍ³²Ó¹¬ÎÒ  ¶âÅá¶âÈ¬"
	"¶âÈ¬¶âÎÏ¶â¿Ï¶âºµ¶âÌé¶â¼Û¶â¶Ô¶â¾¯¶â¼Ü¶â±¯¶âÈ¿¶âØú¶â´Å¶âµð¶â¸¼¶â¶ç"
	"¶âÕà¶â°Ð¶âÅÄ¶âÊñ¶âÀÐÅ£¹Ô¶â¼ë¶âÁ´¶âÀå¶â±¬¶âÔó¶â½¨¶â¾Ó¶âçê¶âÐ³¶â°¸"
	"¶âµþ¶â¸Ç¶âá·¶âØý¶âà§¶âËô¶âË§¶â²Ö¶âÉð¶âËô¶â¹Ä¶âÒù¶âÑÁ¶â¿Ó¶â±×¶â¹â"
	"¶ââÃ¶âÍÆ¶âÁ÷¶â¼¯¶â·ø¶â»Â¶â½É¶âÕò¶âÂ²¶âÒØ¶â×Ä¶âÏ¢¶âÏ¬¶âØ¨¶âÁá¶âÆØ"
	"¶âô¡¶âÈÖ¶âÐ·¶â°¥¶âð´¶âØù¶âØù¶âáÄ¶â°ô¶â  ¶âÔè¶â×¢¶âÜÛ¶âÎ¸¶âÁÍ¶ââº"
	"¶â¸Í¶âóþ¶âð²¶âæã¶â»¿¶â»¿¶âÍå¶â»å¶âÀÉ¶â  Ìç°ìÌç²¼Ìç»³ÌçÊ¸Ìç¿åÌç¹Ã"
	"Ìç»ÔÌç¶ÌÌç·½Ìç¶¦ÌçÏ¤Ìç±÷Ìç±±Ìç±âÌç°¿Ìç³èÌçÀåÌç½­Ìç¼ÔÌçÛËÌç  Ìçâ´"
	"ÌçÇÏÌç  ÌçÓÅÌçÃ£ÌçíäÀé  Ìñ  ¸µ  »ß  Èé  É´  Í­  Êº  ±±  Ôó  ¾£ÅÚ"
	"Ôó  Êâ  ¼÷  ¿â  ¼è  ¹Ä  ±×  °÷  µ´  Ñ¡  ¿ë  ±£  ÇÏ  »å  Î¶  ¥è¿å"
	"ð°  £Å¿Ã³îð²ð²  Ìðð²Ööð²¥Í½¸Â´ð²±«ð²¼þð²±«Êñ±«¾Ó±«±ä±«Ýï±«Ñ»±«¾ª"
	"±«Ýþ±«Èó±«ÎÓ±«±Ñ±«Î±±«°ü±«»¶±«íä±«ÀÆ±«ì¾±«±Ú±ÀÂá±«Öà±«Îò±À°¦ÀÄà§"
	"¹ðÈóÌÌÊñÌÌ¸«ÌÌ±Þ³×ÎÏ³×ºµ³×¿Ï³×Æâ³×±û³×Ã¶³×Èé³×Ëö³×Êº³×·½³×ËÞ³×¾å"
	"³×·£³×Ò³³×½©³×½À³×è©³×ÍÑ³×Ã£³×Á«³×ÊÎ¥æ¥ððê±±Èó  ÀÆðìÀÆðì²»¸«²»¾¤"
	"²»¼ÛÐ¶ÊÇ¸øÊÇÖßÊÇ¿ÃÊÇµÈÊÇ´ÞÊÇÆÅÊÇ²ÌÊÇÉ§ÊÇ»×ÊÇÐ¹ÊÇÆüÊÇÉÑÈÜâºÊÇð²ÊÇ"
	"æãÊÇ²¼É÷Î©É÷É÷ÂæÉ÷¶ñÉ¼É÷É÷É¼¸¤É÷¿©ÆÖ¿©Ôð¿©¸ò¿©¸þ¿©ÂÅ¿©Êã¿©Í¾¿©±±"
	"¿©Ë§¿©Øý¿©±ê¿©Öõ¿©¸Õ¿©ÝÆ¿©µ´¿©Î±¿©»®¿©²¦¿©ÒØ¿©Ôå¿©µ®¿©´ö¿©ô¡¿©Ã§"
	"¿©éË¶å¼ó¼ó°¿¹áÔéÇÏËôÑÒÇÏÇÏÊ¸ÇÏ»ÍÇÏ»ËÇÏÕàÇÏÂæÇÏÅÛÇÏ°çÇÏ¸òÇÏ³ÆÇÏ½£"
	"ÇÏÚÝÇÏ¿»ÇÏÍ³ÇÏÂ¶ÇÏð²ÇÏÖõÇÏÙ¨ÇÏºÉÇÏÇÂÇÏÒ¿ÇÏ»²ÇÏÊèÇÏÉ¼ÇÏÎßÇÏ¶¬ÇÏô¡"
	"ÇÏ¹¬ÇÏÑ¡ÇÏ¼èÇÏâºÇÏÑÃÇÏê÷ÇÏð²ÇÏ¡èÇÏÎï¹ü´³¹üÝÕ¹ü³Æ¹üÈÜ¹üÏ¬¹üéæ¹üº¸"
	"¹üË­¹âÉÊÄ¹×ÄñõÌéñõÊýñõÌÓñõÑÇñõ¾¤ñõÔéñõÊ¦ñõÊññõ¶ÊñõµÈñõ¾¾ñõÒØñõ¿Ü"
	"ñõ°¥ñõÉÐñõÁÍ||++ò¨»Ôò¨¶¦ò¨Ñ»ò¨À£ò¨  ¶§¥Ò¥íÑÄÇòµ´µ´¸¤°Ñµ´µ´æ¨µ´Î¾"
	"µ´  µ´±ÞµûÊýµûÆãµûÊ¿µûÊñµûÀÐµûÅßµû°Âµû´íµû»ÝµûµÙµû·Ïµûº»µû¾ÓµûÊã"
	"µûÍøµû´õµûáµµû°×µûÑ»µûº«µûá·µûÈóµû»²µû±÷µû¸×µûÇ°µûËôµûÒùµû¹Äµû»×"
	"µû½¶µû½ÕµûÀ¤µûÔéµûÛËµû°Òµû»®µû»®µû  µû»ÕµûÎ±µû¿Àµû¹¯µûÚÄµû¾ÏµûÉ¼"
	"µû´îµûÁ½µûË­µûÍÜµûâºÄ»ÑÜÄ»ÑÜÆþÄ»²çÄ»ÒÌÄ»ÒÌÄ»Ä»ÔïÕ÷Ä»·êÄ»±ûÄ»Ä»²Ð"
	"¸ÅÄ»»áÄ»»êÄ»Ä»ÕàÎáÄ»¸òÄ»¹çÄ»Ì¶Ä»¹ÔÄ»¼ªÄ»²æÄ»²æÄ»³ÑÄ»·îÄ»ÖàÄ»³­Ä»"
	"ÀÎÄ»µýÄ»ÅìÄ»ÅìÄ»ÈÜÄ»ÌëÄ»ÒøÄ»·³Ä»Ä»  ±©Ä»Ä»  ËßÄ»¹üÄ»¼åÄ»ÀÔÄ»âÃÄ»"
	"¿¿Ä»´ÌÄ»¼¹Ä»½îÄ»Ì·Ä»¾ÇÄ»ÈÖÄ»Ð·Ä»Ä»  ±ÅÄ»ð²Ä»»åÄ»Àê¿ÞóÃÒùóÃ´Æ¼¯  "
	"¼¯¼ç¼¯ÊÆ¼¯¸â¼¯Â¶¼¯¶Ý    ¼¯¼ÍÐÔÔéóÎÉ×ÇþÉ×óÎ  óÎÊñËãÈó²«  ²ÓÌÞóÕÀê"
	"óÕ¶Ù¹õº£¹õ½Ð¹õÀê¹õÍÄ¹õµÈ¹õµþ¹õ¾°¹õ²»¹õÈù¹õ±Þ¹õìÎ¶Ò  óã  óãÊãðì  "
	"ÚÄóæÚÉóæÆ¦Èé¸ÝÅßá·ÍÑÁÍÍ³É¡´³ÀÆ  »õ  óï¥Òóï¶çóï³îóï¾¤óïÎáóïº±óï·À"
	"óï¸ãóïÂ­óï²°óïã»óïÒø¹çÎ¶µµ  ¹çÐÕ¶Æ  âÃ  ¥¿´Ì¥¿´ÌãÈ  ¿ÃÌ¦";

/*
 ´Á»ú¸ò¤¸¤êÊ¸¤ÎÊ¸»ú¤ò¾Ã¤¹
 */
static int
kanji2index(c1, c2)
unsigned char c1, c2;
{
#if (('¡á')==0x8181)
	/* SJIS */
	if (c1 >= 0xe0) c1 -= 0x40;
	c1 -= 0x81;
	if (c2 >= 0x80) c2--;
	c2 -= 0x40;
	return ((int)c1 * (0xfc - 0x40 + 1 - 1)) + (int)c2;
#else
	/* EUC */
    	return (((int)c1 & 0x7f) - 0x21) * (0x7e - 0x21 + 1) +
	       (((int)c2 & 0x7f) - 0x21);
#endif
}

int
jrubout(engr, nxt, use_rubout, select_rnd)
     char *engr;
     int nxt;
     int use_rubout;
     int select_rnd;
{
    int j;
    unsigned char *s;
    const unsigned char *p;

    if(is_kanji2(engr, nxt)){
	return 1;
      }

    s = (unsigned char *)&engr[nxt];
    if (*s == ' ') return 1;

    if(!is_kanji1(engr, nxt)) return 0;

    j = kanji2index(engr[nxt], engr[nxt + 1]);
    if (j >= 0x0000 && j <= 0x02B1) p = &ro0[j << 2];
    else if (j >= 0x0582 && j <= 0x1116) p = &ro1[(j - 0x0582) << 2];
    else if (j >= 0x1142 && j <= 0x1E7F) p = &ro2[(j - 0x1142) << 2];
    else p = "¡©";
    
    if (p[2] != ' ' || p[3] != ' ') p += select_rnd * 2;
    engr[nxt] = *p++;
    engr[nxt + 1] = *p;

    return 1;
}

static struct trans_verb trans_verb_list[] = {
    {"adjust",	"¤É¤ì", "¤ò", "Ä´À°¤¹¤ë"},
    {"call",	"¤É¤ì", "¤ò", "¸Æ¤Ö"},
    {"charge",	"¤É¤ì", "¤ò", "½¼Å¶¤¹¤ë"},
    {"dip into", "¤É¤ì", "¤Ë", "¿»¤¹"},
    {"dip",	"¤É¤ì", "¤ò", "¿»¤¹"},
    {"drink",	"¤É¤ì", "¤ò", "°û¤à"},
    {"drop",	"¤É¤ì", "¤ò", "ÃÖ¤¯"},
    {"eat",	"¤É¤ì", "¤ò", "¿©¤Ù¤ë"},
    {"grease",	"¤É¤ì", "¤Ë", "ÅÉ¤ë"},
    {"identify", "¤É¤ì", "¤ò", "¼±ÊÌ¤¹¤ë"},
    {"invoke",	"¤É", "¤Î", "ËâÎÏ¤ò»È¤¦"},
    {"name",	"¤É¤ì", "¤ò", "Ì¾¤Å¤±¤ë"},
    {"put on",	"¤É¤ì", "¤ò", "¿È¤Ë¤Ä¤±¤ë"},
    {"read",	"¤É¤ì", "¤ò", "ÆÉ¤à"},
    {"ready",	"¤É¤ì", "¤ò", "ÁõÅ¶¤¹¤ë"},
    {"remove",	"¤É¤ì", "¤ò", "¤Ï¤º¤¹"},
    {"rub",	"¤É¤ì", "¤ò", "¤³¤¹¤ë"},
    {"rub on the stone", "¤É¤ì", "¤ò", "ÀÐ¤Ç¤³¤¹¤ë"},
    {"sacrifice", "¤É¤ì", "¤ò", "Êû¤²¤ë"},
    {"take off", "¤É", "¤Î", "ÁõÈ÷¤ò²ò¤¯"},
    {"throw",	"¤É¤ì", "¤ò", "Åê¤²¤ë"},
    {"tin",	"¤É¤ì", "¤ò", "´ÌµÍ¤á¤Ë¤¹¤ë"},
    {"untrap with", "¤É¤ì", "¤ò", "»È¤Ã¤Æ²ò½ü¤¹¤ë"},
    {"use or apply", "¤É¤ì", "¤ò", "»È¤¦"},
    {"wear",	"¤É¤ì", "¤ò", "¿È¤Ë¤Ä¤±¤ë"},
    {"write on", "¤É¤ì", "¤Ë", "½ñ¤¯"},
    {"write with", "¤É¤ì", "¤ò", "»È¤Ã¤Æ½ñ¤¯"},
    {"zap",	"¤É¤ì", "¤ò", "¿¶¤ê¤«¤¶¤¹"},
    {(void *)0, (void *)0},
};

static struct trans_verb wield =
{"wield",	"¤É¤ì", "¤ò", (void *)0}
;

static struct trans_verb dummyverb =
{(void *)0,	"¤É¤ì", "¤ò", (void *)0}
;

struct trans_verb
*trans_verb(const char *en){
    struct trans_verb *list = trans_verb_list;

    if(!strcmp(en, wield.en)){
	wield.jp = body_part(HANDED);
	return &wield;
    }
    

    while(list->en){
	if(!strcmp(en, list->en)){
	    return list;
	}
	list++;
    }

    dummyverb.en = en;
    dummyverb.jp = en;

    return &dummyverb;;
}
